bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/clkrst_reg.h
/*
 * Copyright (c) 2016-2022 Bouffalolab.
 *
 * This file is part of
 *     *** Bouffalolab Software Dev Kit ***
 *      (see www.bouffalolab.com).
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#ifndef  __CLKRST_REG_H__
#define  __CLKRST_REG_H__

#include "bl808.h"

/* 0x0 : mm_clk_ctrl_cpu */
#define CLKRST_MM_CLK_CTRL_CPU_OFFSET                           (0x0)
#define CLKRST_REG_PLL_EN                                       CLKRST_REG_PLL_EN
#define CLKRST_REG_PLL_EN_POS                                   (0U)
#define CLKRST_REG_PLL_EN_LEN                                   (1U)
#define CLKRST_REG_PLL_EN_MSK                                   (((1U<<CLKRST_REG_PLL_EN_LEN)-1)<<CLKRST_REG_PLL_EN_POS)
#define CLKRST_REG_PLL_EN_UMSK                                  (~(((1U<<CLKRST_REG_PLL_EN_LEN)-1)<<CLKRST_REG_PLL_EN_POS))
#define CLKRST_REG_CPU_CLK_EN                                   CLKRST_REG_CPU_CLK_EN
#define CLKRST_REG_CPU_CLK_EN_POS                               (1U)
#define CLKRST_REG_CPU_CLK_EN_LEN                               (1U)
#define CLKRST_REG_CPU_CLK_EN_MSK                               (((1U<<CLKRST_REG_CPU_CLK_EN_LEN)-1)<<CLKRST_REG_CPU_CLK_EN_POS)
#define CLKRST_REG_CPU_CLK_EN_UMSK                              (~(((1U<<CLKRST_REG_CPU_CLK_EN_LEN)-1)<<CLKRST_REG_CPU_CLK_EN_POS))
#define CLKRST_REG_BCLK_EN                                      CLKRST_REG_BCLK_EN
#define CLKRST_REG_BCLK_EN_POS                                  (2U)
#define CLKRST_REG_BCLK_EN_LEN                                  (1U)
#define CLKRST_REG_BCLK_EN_MSK                                  (((1U<<CLKRST_REG_BCLK_EN_LEN)-1)<<CLKRST_REG_BCLK_EN_POS)
#define CLKRST_REG_BCLK_EN_UMSK                                 (~(((1U<<CLKRST_REG_BCLK_EN_LEN)-1)<<CLKRST_REG_BCLK_EN_POS))
#define CLKRST_REG_A5_CPU_CLK_EN                                CLKRST_REG_A5_CPU_CLK_EN
#define CLKRST_REG_A5_CPU_CLK_EN_POS                            (3U)
#define CLKRST_REG_A5_CPU_CLK_EN_LEN                            (1U)
#define CLKRST_REG_A5_CPU_CLK_EN_MSK                            (((1U<<CLKRST_REG_A5_CPU_CLK_EN_LEN)-1)<<CLKRST_REG_A5_CPU_CLK_EN_POS)
#define CLKRST_REG_A5_CPU_CLK_EN_UMSK                           (~(((1U<<CLKRST_REG_A5_CPU_CLK_EN_LEN)-1)<<CLKRST_REG_A5_CPU_CLK_EN_POS))
#define CLKRST_REG_E74C_CLK_EN                                  CLKRST_REG_E74C_CLK_EN
#define CLKRST_REG_E74C_CLK_EN_POS                              (4U)
#define CLKRST_REG_E74C_CLK_EN_LEN                              (1U)
#define CLKRST_REG_E74C_CLK_EN_MSK                              (((1U<<CLKRST_REG_E74C_CLK_EN_LEN)-1)<<CLKRST_REG_E74C_CLK_EN_POS)
#define CLKRST_REG_E74C_CLK_EN_UMSK                             (~(((1U<<CLKRST_REG_E74C_CLK_EN_LEN)-1)<<CLKRST_REG_E74C_CLK_EN_POS))
#define CLKRST_HBN_UART_CLK_SEL                                 CLKRST_HBN_UART_CLK_SEL
#define CLKRST_HBN_UART_CLK_SEL_POS                             (5U)
#define CLKRST_HBN_UART_CLK_SEL_LEN                             (1U)
#define CLKRST_HBN_UART_CLK_SEL_MSK                             (((1U<<CLKRST_HBN_UART_CLK_SEL_LEN)-1)<<CLKRST_HBN_UART_CLK_SEL_POS)
#define CLKRST_HBN_UART_CLK_SEL_UMSK                            (~(((1U<<CLKRST_HBN_UART_CLK_SEL_LEN)-1)<<CLKRST_HBN_UART_CLK_SEL_POS))
#define CLKRST_REG_E74C_CLK_EN_2                                CLKRST_REG_E74C_CLK_EN_2
#define CLKRST_REG_E74C_CLK_EN_2_POS                            (6U)
#define CLKRST_REG_E74C_CLK_EN_2_LEN                            (1U)
#define CLKRST_REG_E74C_CLK_EN_2_MSK                            (((1U<<CLKRST_REG_E74C_CLK_EN_2_LEN)-1)<<CLKRST_REG_E74C_CLK_EN_2_POS)
#define CLKRST_REG_E74C_CLK_EN_2_UMSK                           (~(((1U<<CLKRST_REG_E74C_CLK_EN_2_LEN)-1)<<CLKRST_REG_E74C_CLK_EN_2_POS))
#define CLKRST_REG_PLL_SEL                                      CLKRST_REG_PLL_SEL
#define CLKRST_REG_PLL_SEL_POS                                  (8U)
#define CLKRST_REG_PLL_SEL_LEN                                  (2U)
#define CLKRST_REG_PLL_SEL_MSK                                  (((1U<<CLKRST_REG_PLL_SEL_LEN)-1)<<CLKRST_REG_PLL_SEL_POS)
#define CLKRST_REG_PLL_SEL_UMSK                                 (~(((1U<<CLKRST_REG_PLL_SEL_LEN)-1)<<CLKRST_REG_PLL_SEL_POS))
#define CLKRST_HBN_ROOT_CLK_SEL                                 CLKRST_HBN_ROOT_CLK_SEL
#define CLKRST_HBN_ROOT_CLK_SEL_POS                             (10U)
#define CLKRST_HBN_ROOT_CLK_SEL_LEN                             (2U)
#define CLKRST_HBN_ROOT_CLK_SEL_MSK                             (((1U<<CLKRST_HBN_ROOT_CLK_SEL_LEN)-1)<<CLKRST_HBN_ROOT_CLK_SEL_POS)
#define CLKRST_HBN_ROOT_CLK_SEL_UMSK                            (~(((1U<<CLKRST_HBN_ROOT_CLK_SEL_LEN)-1)<<CLKRST_HBN_ROOT_CLK_SEL_POS))
#define CLKRST_REG_M4_FCLK_EN                                   CLKRST_REG_M4_FCLK_EN
#define CLKRST_REG_M4_FCLK_EN_POS                               (12U)
#define CLKRST_REG_M4_FCLK_EN_LEN                               (1U)
#define CLKRST_REG_M4_FCLK_EN_MSK                               (((1U<<CLKRST_REG_M4_FCLK_EN_LEN)-1)<<CLKRST_REG_M4_FCLK_EN_POS)
#define CLKRST_REG_M4_FCLK_EN_UMSK                              (~(((1U<<CLKRST_REG_M4_FCLK_EN_LEN)-1)<<CLKRST_REG_M4_FCLK_EN_POS))
#define CLKRST_REG_M4_FCLK_SEL                                  CLKRST_REG_M4_FCLK_SEL
#define CLKRST_REG_M4_FCLK_SEL_POS                              (13U)
#define CLKRST_REG_M4_FCLK_SEL_LEN                              (1U)
#define CLKRST_REG_M4_FCLK_SEL_MSK                              (((1U<<CLKRST_REG_M4_FCLK_SEL_LEN)-1)<<CLKRST_REG_M4_FCLK_SEL_POS)
#define CLKRST_REG_M4_FCLK_SEL_UMSK                             (~(((1U<<CLKRST_REG_M4_FCLK_SEL_LEN)-1)<<CLKRST_REG_M4_FCLK_SEL_POS))
#define CLKRST_REG_M4_HCLK_EN                                   CLKRST_REG_M4_HCLK_EN
#define CLKRST_REG_M4_HCLK_EN_POS                               (14U)
#define CLKRST_REG_M4_HCLK_EN_LEN                               (1U)
#define CLKRST_REG_M4_HCLK_EN_MSK                               (((1U<<CLKRST_REG_M4_HCLK_EN_LEN)-1)<<CLKRST_REG_M4_HCLK_EN_POS)
#define CLKRST_REG_M4_HCLK_EN_UMSK                              (~(((1U<<CLKRST_REG_M4_HCLK_EN_LEN)-1)<<CLKRST_REG_M4_HCLK_EN_POS))
#define CLKRST_REG_M4_TRACE_EN                                  CLKRST_REG_M4_TRACE_EN
#define CLKRST_REG_M4_TRACE_EN_POS                              (15U)
#define CLKRST_REG_M4_TRACE_EN_LEN                              (1U)
#define CLKRST_REG_M4_TRACE_EN_MSK                              (((1U<<CLKRST_REG_M4_TRACE_EN_LEN)-1)<<CLKRST_REG_M4_TRACE_EN_POS)
#define CLKRST_REG_M4_TRACE_EN_UMSK                             (~(((1U<<CLKRST_REG_M4_TRACE_EN_LEN)-1)<<CLKRST_REG_M4_TRACE_EN_POS))
#define CLKRST_CPU_CLK_SW_STATE                                 CLKRST_CPU_CLK_SW_STATE
#define CLKRST_CPU_CLK_SW_STATE_POS                             (24U)
#define CLKRST_CPU_CLK_SW_STATE_LEN                             (3U)
#define CLKRST_CPU_CLK_SW_STATE_MSK                             (((1U<<CLKRST_CPU_CLK_SW_STATE_LEN)-1)<<CLKRST_CPU_CLK_SW_STATE_POS)
#define CLKRST_CPU_CLK_SW_STATE_UMSK                            (~(((1U<<CLKRST_CPU_CLK_SW_STATE_LEN)-1)<<CLKRST_CPU_CLK_SW_STATE_POS))
#define CLKRST_M4_FCLK_SW_STATE                                 CLKRST_M4_FCLK_SW_STATE
#define CLKRST_M4_FCLK_SW_STATE_POS                             (28U)
#define CLKRST_M4_FCLK_SW_STATE_LEN                             (3U)
#define CLKRST_M4_FCLK_SW_STATE_MSK                             (((1U<<CLKRST_M4_FCLK_SW_STATE_LEN)-1)<<CLKRST_M4_FCLK_SW_STATE_POS)
#define CLKRST_M4_FCLK_SW_STATE_UMSK                            (~(((1U<<CLKRST_M4_FCLK_SW_STATE_LEN)-1)<<CLKRST_M4_FCLK_SW_STATE_POS))

/* 0x4 : mm_clk_cpu */
#define CLKRST_MM_CLK_CPU_OFFSET                                (0x4)
#define CLKRST_REG_CPU_CLK_DIV                                  CLKRST_REG_CPU_CLK_DIV
#define CLKRST_REG_CPU_CLK_DIV_POS                              (0U)
#define CLKRST_REG_CPU_CLK_DIV_LEN                              (8U)
#define CLKRST_REG_CPU_CLK_DIV_MSK                              (((1U<<CLKRST_REG_CPU_CLK_DIV_LEN)-1)<<CLKRST_REG_CPU_CLK_DIV_POS)
#define CLKRST_REG_CPU_CLK_DIV_UMSK                             (~(((1U<<CLKRST_REG_CPU_CLK_DIV_LEN)-1)<<CLKRST_REG_CPU_CLK_DIV_POS))
#define CLKRST_REG_CNN_CLK_DIV_EN                               CLKRST_REG_CNN_CLK_DIV_EN
#define CLKRST_REG_CNN_CLK_DIV_EN_POS                           (8U)
#define CLKRST_REG_CNN_CLK_DIV_EN_LEN                           (1U)
#define CLKRST_REG_CNN_CLK_DIV_EN_MSK                           (((1U<<CLKRST_REG_CNN_CLK_DIV_EN_LEN)-1)<<CLKRST_REG_CNN_CLK_DIV_EN_POS)
#define CLKRST_REG_CNN_CLK_DIV_EN_UMSK                          (~(((1U<<CLKRST_REG_CNN_CLK_DIV_EN_LEN)-1)<<CLKRST_REG_CNN_CLK_DIV_EN_POS))
#define CLKRST_REG_CNN_CLK_SEL                                  CLKRST_REG_CNN_CLK_SEL
#define CLKRST_REG_CNN_CLK_SEL_POS                              (9U)
#define CLKRST_REG_CNN_CLK_SEL_LEN                              (2U)
#define CLKRST_REG_CNN_CLK_SEL_MSK                              (((1U<<CLKRST_REG_CNN_CLK_SEL_LEN)-1)<<CLKRST_REG_CNN_CLK_SEL_POS)
#define CLKRST_REG_CNN_CLK_SEL_UMSK                             (~(((1U<<CLKRST_REG_CNN_CLK_SEL_LEN)-1)<<CLKRST_REG_CNN_CLK_SEL_POS))
#define CLKRST_REG_BCLK_DIV                                     CLKRST_REG_BCLK_DIV
#define CLKRST_REG_BCLK_DIV_POS                                 (16U)
#define CLKRST_REG_BCLK_DIV_LEN                                 (8U)
#define CLKRST_REG_BCLK_DIV_MSK                                 (((1U<<CLKRST_REG_BCLK_DIV_LEN)-1)<<CLKRST_REG_BCLK_DIV_POS)
#define CLKRST_REG_BCLK_DIV_UMSK                                (~(((1U<<CLKRST_REG_BCLK_DIV_LEN)-1)<<CLKRST_REG_BCLK_DIV_POS))

/* 0x8 : spp_dp_clk */
#define CLKRST_SPP_DP_CLK_OFFSET                                (0x8)
#define CLKRST_REG_SPP_CLK_DIV_EN                               CLKRST_REG_SPP_CLK_DIV_EN
#define CLKRST_REG_SPP_CLK_DIV_EN_POS                           (0U)
#define CLKRST_REG_SPP_CLK_DIV_EN_LEN                           (1U)
#define CLKRST_REG_SPP_CLK_DIV_EN_MSK                           (((1U<<CLKRST_REG_SPP_CLK_DIV_EN_LEN)-1)<<CLKRST_REG_SPP_CLK_DIV_EN_POS)
#define CLKRST_REG_SPP_CLK_DIV_EN_UMSK                          (~(((1U<<CLKRST_REG_SPP_CLK_DIV_EN_LEN)-1)<<CLKRST_REG_SPP_CLK_DIV_EN_POS))
#define CLKRST_REG_SPP_CLK_SEL                                  CLKRST_REG_SPP_CLK_SEL
#define CLKRST_REG_SPP_CLK_SEL_POS                              (1U)
#define CLKRST_REG_SPP_CLK_SEL_LEN                              (2U)
#define CLKRST_REG_SPP_CLK_SEL_MSK                              (((1U<<CLKRST_REG_SPP_CLK_SEL_LEN)-1)<<CLKRST_REG_SPP_CLK_SEL_POS)
#define CLKRST_REG_SPP_CLK_SEL_UMSK                             (~(((1U<<CLKRST_REG_SPP_CLK_SEL_LEN)-1)<<CLKRST_REG_SPP_CLK_SEL_POS))
#define CLKRST_REG_SPP_CLK_DIV                                  CLKRST_REG_SPP_CLK_DIV
#define CLKRST_REG_SPP_CLK_DIV_POS                              (8U)
#define CLKRST_REG_SPP_CLK_DIV_LEN                              (8U)
#define CLKRST_REG_SPP_CLK_DIV_MSK                              (((1U<<CLKRST_REG_SPP_CLK_DIV_LEN)-1)<<CLKRST_REG_SPP_CLK_DIV_POS)
#define CLKRST_REG_SPP_CLK_DIV_UMSK                             (~(((1U<<CLKRST_REG_SPP_CLK_DIV_LEN)-1)<<CLKRST_REG_SPP_CLK_DIV_POS))
#define CLKRST_REG_HDMI_CLK_DIV_EN                              CLKRST_REG_HDMI_CLK_DIV_EN
#define CLKRST_REG_HDMI_CLK_DIV_EN_POS                          (16U)
#define CLKRST_REG_HDMI_CLK_DIV_EN_LEN                          (1U)
#define CLKRST_REG_HDMI_CLK_DIV_EN_MSK                          (((1U<<CLKRST_REG_HDMI_CLK_DIV_EN_LEN)-1)<<CLKRST_REG_HDMI_CLK_DIV_EN_POS)
#define CLKRST_REG_HDMI_CLK_DIV_EN_UMSK                         (~(((1U<<CLKRST_REG_HDMI_CLK_DIV_EN_LEN)-1)<<CLKRST_REG_HDMI_CLK_DIV_EN_POS))
#define CLKRST_REG_DISP_CLK_SEL                                 CLKRST_REG_DISP_CLK_SEL
#define CLKRST_REG_DISP_CLK_SEL_POS                             (17U)
#define CLKRST_REG_DISP_CLK_SEL_LEN                             (1U)
#define CLKRST_REG_DISP_CLK_SEL_MSK                             (((1U<<CLKRST_REG_DISP_CLK_SEL_LEN)-1)<<CLKRST_REG_DISP_CLK_SEL_POS)
#define CLKRST_REG_DISP_CLK_SEL_UMSK                            (~(((1U<<CLKRST_REG_DISP_CLK_SEL_LEN)-1)<<CLKRST_REG_DISP_CLK_SEL_POS))
#define CLKRST_REG_DISP_CLK_DIV                                 CLKRST_REG_DISP_CLK_DIV
#define CLKRST_REG_DISP_CLK_DIV_POS                             (20U)
#define CLKRST_REG_DISP_CLK_DIV_LEN                             (4U)
#define CLKRST_REG_DISP_CLK_DIV_MSK                             (((1U<<CLKRST_REG_DISP_CLK_DIV_LEN)-1)<<CLKRST_REG_DISP_CLK_DIV_POS)
#define CLKRST_REG_DISP_CLK_DIV_UMSK                            (~(((1U<<CLKRST_REG_DISP_CLK_DIV_LEN)-1)<<CLKRST_REG_DISP_CLK_DIV_POS))


/* 0xC : codec_clk */
#define CLKRST_CODEC_CLK_OFFSET                                 (0xC)
#define CLKRST_REG_H264_CLK_DIV_EN                              CLKRST_REG_H264_CLK_DIV_EN
#define CLKRST_REG_H264_CLK_DIV_EN_POS                          (8U)
#define CLKRST_REG_H264_CLK_DIV_EN_LEN                          (1U)
#define CLKRST_REG_H264_CLK_DIV_EN_MSK                          (((1U<<CLKRST_REG_H264_CLK_DIV_EN_LEN)-1)<<CLKRST_REG_H264_CLK_DIV_EN_POS)
#define CLKRST_REG_H264_CLK_DIV_EN_UMSK                         (~(((1U<<CLKRST_REG_H264_CLK_DIV_EN_LEN)-1)<<CLKRST_REG_H264_CLK_DIV_EN_POS))
#define CLKRST_REG_H264_CLK_SEL                                 CLKRST_REG_H264_CLK_SEL
#define CLKRST_REG_H264_CLK_SEL_POS                             (9U)
#define CLKRST_REG_H264_CLK_SEL_LEN                             (2U)
#define CLKRST_REG_H264_CLK_SEL_MSK                             (((1U<<CLKRST_REG_H264_CLK_SEL_LEN)-1)<<CLKRST_REG_H264_CLK_SEL_POS)
#define CLKRST_REG_H264_CLK_SEL_UMSK                            (~(((1U<<CLKRST_REG_H264_CLK_SEL_LEN)-1)<<CLKRST_REG_H264_CLK_SEL_POS))
#define CLKRST_REG_H264_CLK_DIV                                 CLKRST_REG_H264_CLK_DIV
#define CLKRST_REG_H264_CLK_DIV_POS                             (12U)
#define CLKRST_REG_H264_CLK_DIV_LEN                             (3U)
#define CLKRST_REG_H264_CLK_DIV_MSK                             (((1U<<CLKRST_REG_H264_CLK_DIV_LEN)-1)<<CLKRST_REG_H264_CLK_DIV_POS)
#define CLKRST_REG_H264_CLK_DIV_UMSK                            (~(((1U<<CLKRST_REG_H264_CLK_DIV_LEN)-1)<<CLKRST_REG_H264_CLK_DIV_POS))

/* 0x10 : mm_clk_ctrl_peri */
#define CLKRST_MM_CLK_CTRL_PERI_OFFSET                          (0x10)
#define CLKRST_REG_I2C_CLK_DIV                                  CLKRST_REG_I2C_CLK_DIV
#define CLKRST_REG_I2C_CLK_DIV_POS                              (0U)
#define CLKRST_REG_I2C_CLK_DIV_LEN                              (8U)
#define CLKRST_REG_I2C_CLK_DIV_MSK                              (((1U<<CLKRST_REG_I2C_CLK_DIV_LEN)-1)<<CLKRST_REG_I2C_CLK_DIV_POS)
#define CLKRST_REG_I2C_CLK_DIV_UMSK                             (~(((1U<<CLKRST_REG_I2C_CLK_DIV_LEN)-1)<<CLKRST_REG_I2C_CLK_DIV_POS))
#define CLKRST_REG_I2C_CLK_DIV_EN                               CLKRST_REG_I2C_CLK_DIV_EN
#define CLKRST_REG_I2C_CLK_DIV_EN_POS                           (8U)
#define CLKRST_REG_I2C_CLK_DIV_EN_LEN                           (1U)
#define CLKRST_REG_I2C_CLK_DIV_EN_MSK                           (((1U<<CLKRST_REG_I2C_CLK_DIV_EN_LEN)-1)<<CLKRST_REG_I2C_CLK_DIV_EN_POS)
#define CLKRST_REG_I2C_CLK_DIV_EN_UMSK                          (~(((1U<<CLKRST_REG_I2C_CLK_DIV_EN_LEN)-1)<<CLKRST_REG_I2C_CLK_DIV_EN_POS))
#define CLKRST_REG_I2CA_CLK_EN                                  CLKRST_REG_I2CA_CLK_EN
#define CLKRST_REG_I2CA_CLK_EN_POS                              (9U)
#define CLKRST_REG_I2CA_CLK_EN_LEN                              (1U)
#define CLKRST_REG_I2CA_CLK_EN_MSK                              (((1U<<CLKRST_REG_I2CA_CLK_EN_LEN)-1)<<CLKRST_REG_I2CA_CLK_EN_POS)
#define CLKRST_REG_I2CA_CLK_EN_UMSK                             (~(((1U<<CLKRST_REG_I2CA_CLK_EN_LEN)-1)<<CLKRST_REG_I2CA_CLK_EN_POS))
#define CLKRST_REG_I2CB_CLK_EN                                  CLKRST_REG_I2CB_CLK_EN
#define CLKRST_REG_I2CB_CLK_EN_POS                              (10U)
#define CLKRST_REG_I2CB_CLK_EN_LEN                              (1U)
#define CLKRST_REG_I2CB_CLK_EN_MSK                              (((1U<<CLKRST_REG_I2CB_CLK_EN_LEN)-1)<<CLKRST_REG_I2CB_CLK_EN_POS)
#define CLKRST_REG_I2CB_CLK_EN_UMSK                             (~(((1U<<CLKRST_REG_I2CB_CLK_EN_LEN)-1)<<CLKRST_REG_I2CB_CLK_EN_POS))
#define CLKRST_REG_SDH_CLK_EN                                   CLKRST_REG_SDH_CLK_EN
#define CLKRST_REG_SDH_CLK_EN_POS                               (12U)
#define CLKRST_REG_SDH_CLK_EN_LEN                               (1U)
#define CLKRST_REG_SDH_CLK_EN_MSK                               (((1U<<CLKRST_REG_SDH_CLK_EN_LEN)-1)<<CLKRST_REG_SDH_CLK_EN_POS)
#define CLKRST_REG_SDH_CLK_EN_UMSK                              (~(((1U<<CLKRST_REG_SDH_CLK_EN_LEN)-1)<<CLKRST_REG_SDH_CLK_EN_POS))
#define CLKRST_REG_SDH_CLK_SEL                                  CLKRST_REG_SDH_CLK_SEL
#define CLKRST_REG_SDH_CLK_SEL_POS                              (13U)
#define CLKRST_REG_SDH_CLK_SEL_LEN                              (3U)
#define CLKRST_REG_SDH_CLK_SEL_MSK                              (((1U<<CLKRST_REG_SDH_CLK_SEL_LEN)-1)<<CLKRST_REG_SDH_CLK_SEL_POS)
#define CLKRST_REG_SDH_CLK_SEL_UMSK                             (~(((1U<<CLKRST_REG_SDH_CLK_SEL_LEN)-1)<<CLKRST_REG_SDH_CLK_SEL_POS))
#define CLKRST_REG_UART_CLK_DIV_EN                              CLKRST_REG_UART_CLK_DIV_EN
#define CLKRST_REG_UART_CLK_DIV_EN_POS                          (16U)
#define CLKRST_REG_UART_CLK_DIV_EN_LEN                          (1U)
#define CLKRST_REG_UART_CLK_DIV_EN_MSK                          (((1U<<CLKRST_REG_UART_CLK_DIV_EN_LEN)-1)<<CLKRST_REG_UART_CLK_DIV_EN_POS)
#define CLKRST_REG_UART_CLK_DIV_EN_UMSK                         (~(((1U<<CLKRST_REG_UART_CLK_DIV_EN_LEN)-1)<<CLKRST_REG_UART_CLK_DIV_EN_POS))
#define CLKRST_REG_UART_CLK_DIV                                 CLKRST_REG_UART_CLK_DIV
#define CLKRST_REG_UART_CLK_DIV_POS                             (17U)
#define CLKRST_REG_UART_CLK_DIV_LEN                             (3U)
#define CLKRST_REG_UART_CLK_DIV_MSK                             (((1U<<CLKRST_REG_UART_CLK_DIV_LEN)-1)<<CLKRST_REG_UART_CLK_DIV_POS)
#define CLKRST_REG_UART_CLK_DIV_UMSK                            (~(((1U<<CLKRST_REG_UART_CLK_DIV_LEN)-1)<<CLKRST_REG_UART_CLK_DIV_POS))
#define CLKRST_REG_ETH_CLK_EN                                   CLKRST_REG_ETH_CLK_EN
#define CLKRST_REG_ETH_CLK_EN_POS                               (20U)
#define CLKRST_REG_ETH_CLK_EN_LEN                               (1U)
#define CLKRST_REG_ETH_CLK_EN_MSK                               (((1U<<CLKRST_REG_ETH_CLK_EN_LEN)-1)<<CLKRST_REG_ETH_CLK_EN_POS)
#define CLKRST_REG_ETH_CLK_EN_UMSK                              (~(((1U<<CLKRST_REG_ETH_CLK_EN_LEN)-1)<<CLKRST_REG_ETH_CLK_EN_POS))
#define CLKRST_REG_ETH_CLK_SEL                                  CLKRST_REG_ETH_CLK_SEL
#define CLKRST_REG_ETH_CLK_SEL_POS                              (21U)
#define CLKRST_REG_ETH_CLK_SEL_LEN                              (2U)
#define CLKRST_REG_ETH_CLK_SEL_MSK                              (((1U<<CLKRST_REG_ETH_CLK_SEL_LEN)-1)<<CLKRST_REG_ETH_CLK_SEL_POS)
#define CLKRST_REG_ETH_CLK_SEL_UMSK                             (~(((1U<<CLKRST_REG_ETH_CLK_SEL_LEN)-1)<<CLKRST_REG_ETH_CLK_SEL_POS))
#define CLKRST_REG_SPI_CLK_DIV_EN                               CLKRST_REG_SPI_CLK_DIV_EN
#define CLKRST_REG_SPI_CLK_DIV_EN_POS                           (23U)
#define CLKRST_REG_SPI_CLK_DIV_EN_LEN                           (1U)
#define CLKRST_REG_SPI_CLK_DIV_EN_MSK                           (((1U<<CLKRST_REG_SPI_CLK_DIV_EN_LEN)-1)<<CLKRST_REG_SPI_CLK_DIV_EN_POS)
#define CLKRST_REG_SPI_CLK_DIV_EN_UMSK                          (~(((1U<<CLKRST_REG_SPI_CLK_DIV_EN_LEN)-1)<<CLKRST_REG_SPI_CLK_DIV_EN_POS))
#define CLKRST_REG_SPI_CLK_DIV                                  CLKRST_REG_SPI_CLK_DIV
#define CLKRST_REG_SPI_CLK_DIV_POS                              (24U)
#define CLKRST_REG_SPI_CLK_DIV_LEN                              (8U)
#define CLKRST_REG_SPI_CLK_DIV_MSK                              (((1U<<CLKRST_REG_SPI_CLK_DIV_LEN)-1)<<CLKRST_REG_SPI_CLK_DIV_POS)
#define CLKRST_REG_SPI_CLK_DIV_UMSK                             (~(((1U<<CLKRST_REG_SPI_CLK_DIV_LEN)-1)<<CLKRST_REG_SPI_CLK_DIV_POS))

