bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/clkrst_reg.h
/* 0x14 : mm_clk_ctrl_peri2 */
#define CLKRST_MM_CLK_CTRL_PERI2_OFFSET                         (0x14)
#define CLKRST_REG_I2S0_CLK_DIV                                 CLKRST_REG_I2S0_CLK_DIV
#define CLKRST_REG_I2S0_CLK_DIV_POS                             (0U)
#define CLKRST_REG_I2S0_CLK_DIV_LEN                             (6U)
#define CLKRST_REG_I2S0_CLK_DIV_MSK                             (((1U<<CLKRST_REG_I2S0_CLK_DIV_LEN)-1)<<CLKRST_REG_I2S0_CLK_DIV_POS)
#define CLKRST_REG_I2S0_CLK_DIV_UMSK                            (~(((1U<<CLKRST_REG_I2S0_CLK_DIV_LEN)-1)<<CLKRST_REG_I2S0_CLK_DIV_POS))
#define CLKRST_REG_I2S0_REF_CLK_OE                              CLKRST_REG_I2S0_REF_CLK_OE
#define CLKRST_REG_I2S0_REF_CLK_OE_POS                          (6U)
#define CLKRST_REG_I2S0_REF_CLK_OE_LEN                          (1U)
#define CLKRST_REG_I2S0_REF_CLK_OE_MSK                          (((1U<<CLKRST_REG_I2S0_REF_CLK_OE_LEN)-1)<<CLKRST_REG_I2S0_REF_CLK_OE_POS)
#define CLKRST_REG_I2S0_REF_CLK_OE_UMSK                         (~(((1U<<CLKRST_REG_I2S0_REF_CLK_OE_LEN)-1)<<CLKRST_REG_I2S0_REF_CLK_OE_POS))
#define CLKRST_REG_I2S0_CLK_EN                                  CLKRST_REG_I2S0_CLK_EN
#define CLKRST_REG_I2S0_CLK_EN_POS                              (7U)
#define CLKRST_REG_I2S0_CLK_EN_LEN                              (1U)
#define CLKRST_REG_I2S0_CLK_EN_MSK                              (((1U<<CLKRST_REG_I2S0_CLK_EN_LEN)-1)<<CLKRST_REG_I2S0_CLK_EN_POS)
#define CLKRST_REG_I2S0_CLK_EN_UMSK                             (~(((1U<<CLKRST_REG_I2S0_CLK_EN_LEN)-1)<<CLKRST_REG_I2S0_CLK_EN_POS))
#define CLKRST_REG_I2S1_CLK_DIV                                 CLKRST_REG_I2S1_CLK_DIV
#define CLKRST_REG_I2S1_CLK_DIV_POS                             (8U)
#define CLKRST_REG_I2S1_CLK_DIV_LEN                             (6U)
#define CLKRST_REG_I2S1_CLK_DIV_MSK                             (((1U<<CLKRST_REG_I2S1_CLK_DIV_LEN)-1)<<CLKRST_REG_I2S1_CLK_DIV_POS)
#define CLKRST_REG_I2S1_CLK_DIV_UMSK                            (~(((1U<<CLKRST_REG_I2S1_CLK_DIV_LEN)-1)<<CLKRST_REG_I2S1_CLK_DIV_POS))
#define CLKRST_REG_I2S1_REF_CLK_OE                              CLKRST_REG_I2S1_REF_CLK_OE
#define CLKRST_REG_I2S1_REF_CLK_OE_POS                          (14U)
#define CLKRST_REG_I2S1_REF_CLK_OE_LEN                          (1U)
#define CLKRST_REG_I2S1_REF_CLK_OE_MSK                          (((1U<<CLKRST_REG_I2S1_REF_CLK_OE_LEN)-1)<<CLKRST_REG_I2S1_REF_CLK_OE_POS)
#define CLKRST_REG_I2S1_REF_CLK_OE_UMSK                         (~(((1U<<CLKRST_REG_I2S1_REF_CLK_OE_LEN)-1)<<CLKRST_REG_I2S1_REF_CLK_OE_POS))
#define CLKRST_REG_I2S1_CLK_EN                                  CLKRST_REG_I2S1_CLK_EN
#define CLKRST_REG_I2S1_CLK_EN_POS                              (15U)
#define CLKRST_REG_I2S1_CLK_EN_LEN                              (1U)
#define CLKRST_REG_I2S1_CLK_EN_MSK                              (((1U<<CLKRST_REG_I2S1_CLK_EN_LEN)-1)<<CLKRST_REG_I2S1_CLK_EN_POS)
#define CLKRST_REG_I2S1_CLK_EN_UMSK                             (~(((1U<<CLKRST_REG_I2S1_CLK_EN_LEN)-1)<<CLKRST_REG_I2S1_CLK_EN_POS))
#define CLKRST_REG_PDM0_CLK_DIV                                 CLKRST_REG_PDM0_CLK_DIV
#define CLKRST_REG_PDM0_CLK_DIV_POS                             (16U)
#define CLKRST_REG_PDM0_CLK_DIV_LEN                             (6U)
#define CLKRST_REG_PDM0_CLK_DIV_MSK                             (((1U<<CLKRST_REG_PDM0_CLK_DIV_LEN)-1)<<CLKRST_REG_PDM0_CLK_DIV_POS)
#define CLKRST_REG_PDM0_CLK_DIV_UMSK                            (~(((1U<<CLKRST_REG_PDM0_CLK_DIV_LEN)-1)<<CLKRST_REG_PDM0_CLK_DIV_POS))
#define CLKRST_REG_PDM0_CLK_EN                                  CLKRST_REG_PDM0_CLK_EN
#define CLKRST_REG_PDM0_CLK_EN_POS                              (22U)
#define CLKRST_REG_PDM0_CLK_EN_LEN                              (1U)
#define CLKRST_REG_PDM0_CLK_EN_MSK                              (((1U<<CLKRST_REG_PDM0_CLK_EN_LEN)-1)<<CLKRST_REG_PDM0_CLK_EN_POS)
#define CLKRST_REG_PDM0_CLK_EN_UMSK                             (~(((1U<<CLKRST_REG_PDM0_CLK_EN_LEN)-1)<<CLKRST_REG_PDM0_CLK_EN_POS))
#define CLKRST_REG_PDM1_CLK_DIV                                 CLKRST_REG_PDM1_CLK_DIV
#define CLKRST_REG_PDM1_CLK_DIV_POS                             (24U)
#define CLKRST_REG_PDM1_CLK_DIV_LEN                             (6U)
#define CLKRST_REG_PDM1_CLK_DIV_MSK                             (((1U<<CLKRST_REG_PDM1_CLK_DIV_LEN)-1)<<CLKRST_REG_PDM1_CLK_DIV_POS)
#define CLKRST_REG_PDM1_CLK_DIV_UMSK                            (~(((1U<<CLKRST_REG_PDM1_CLK_DIV_LEN)-1)<<CLKRST_REG_PDM1_CLK_DIV_POS))
#define CLKRST_REG_PDM1_CLK_EN                                  CLKRST_REG_PDM1_CLK_EN
#define CLKRST_REG_PDM1_CLK_EN_POS                              (30U)
#define CLKRST_REG_PDM1_CLK_EN_LEN                              (1U)
#define CLKRST_REG_PDM1_CLK_EN_MSK                              (((1U<<CLKRST_REG_PDM1_CLK_EN_LEN)-1)<<CLKRST_REG_PDM1_CLK_EN_POS)
#define CLKRST_REG_PDM1_CLK_EN_UMSK                             (~(((1U<<CLKRST_REG_PDM1_CLK_EN_LEN)-1)<<CLKRST_REG_PDM1_CLK_EN_POS))

/* 0x20 : mm_clk_32k */
#define CLKRST_MM_CLK_32K_OFFSET                                (0x20)
#define CLKRST_REG_EN_DIG_32K_GEN                               CLKRST_REG_EN_DIG_32K_GEN
#define CLKRST_REG_EN_DIG_32K_GEN_POS                           (0U)
#define CLKRST_REG_EN_DIG_32K_GEN_LEN                           (1U)
#define CLKRST_REG_EN_DIG_32K_GEN_MSK                           (((1U<<CLKRST_REG_EN_DIG_32K_GEN_LEN)-1)<<CLKRST_REG_EN_DIG_32K_GEN_POS)
#define CLKRST_REG_EN_DIG_32K_GEN_UMSK                          (~(((1U<<CLKRST_REG_EN_DIG_32K_GEN_LEN)-1)<<CLKRST_REG_EN_DIG_32K_GEN_POS))
#define CLKRST_REG_EN_COMP_SAT                                  CLKRST_REG_EN_COMP_SAT
#define CLKRST_REG_EN_COMP_SAT_POS                              (1U)
#define CLKRST_REG_EN_COMP_SAT_LEN                              (1U)
#define CLKRST_REG_EN_COMP_SAT_MSK                              (((1U<<CLKRST_REG_EN_COMP_SAT_LEN)-1)<<CLKRST_REG_EN_COMP_SAT_POS)
#define CLKRST_REG_EN_COMP_SAT_UMSK                             (~(((1U<<CLKRST_REG_EN_COMP_SAT_LEN)-1)<<CLKRST_REG_EN_COMP_SAT_POS))
#define CLKRST_REG_512K_SEL                                     CLKRST_REG_512K_SEL
#define CLKRST_REG_512K_SEL_POS                                 (2U)
#define CLKRST_REG_512K_SEL_LEN                                 (2U)
#define CLKRST_REG_512K_SEL_MSK                                 (((1U<<CLKRST_REG_512K_SEL_LEN)-1)<<CLKRST_REG_512K_SEL_POS)
#define CLKRST_REG_512K_SEL_UMSK                                (~(((1U<<CLKRST_REG_512K_SEL_LEN)-1)<<CLKRST_REG_512K_SEL_POS))
#define CLKRST_REG_DIG_32K_CNT                                  CLKRST_REG_DIG_32K_CNT
#define CLKRST_REG_DIG_32K_CNT_POS                              (4U)
#define CLKRST_REG_DIG_32K_CNT_LEN                              (11U)
#define CLKRST_REG_DIG_32K_CNT_MSK                              (((1U<<CLKRST_REG_DIG_32K_CNT_LEN)-1)<<CLKRST_REG_DIG_32K_CNT_POS)
#define CLKRST_REG_DIG_32K_CNT_UMSK                             (~(((1U<<CLKRST_REG_DIG_32K_CNT_LEN)-1)<<CLKRST_REG_DIG_32K_CNT_POS))

/* 0x40 : mm_sw_sys_reset */
#define CLKRST_MM_SW_SYS_RESET_OFFSET                           (0x40)
#define CLKRST_REG_CTRL_SYS_RESET                               CLKRST_REG_CTRL_SYS_RESET
#define CLKRST_REG_CTRL_SYS_RESET_POS                           (0U)
#define CLKRST_REG_CTRL_SYS_RESET_LEN                           (1U)
#define CLKRST_REG_CTRL_SYS_RESET_MSK                           (((1U<<CLKRST_REG_CTRL_SYS_RESET_LEN)-1)<<CLKRST_REG_CTRL_SYS_RESET_POS)
#define CLKRST_REG_CTRL_SYS_RESET_UMSK                          (~(((1U<<CLKRST_REG_CTRL_SYS_RESET_LEN)-1)<<CLKRST_REG_CTRL_SYS_RESET_POS))
#define CLKRST_REG_CTRL_CPU_RESET                               CLKRST_REG_CTRL_CPU_RESET
#define CLKRST_REG_CTRL_CPU_RESET_POS                           (1U)
#define CLKRST_REG_CTRL_CPU_RESET_LEN                           (1U)
#define CLKRST_REG_CTRL_CPU_RESET_MSK                           (((1U<<CLKRST_REG_CTRL_CPU_RESET_LEN)-1)<<CLKRST_REG_CTRL_CPU_RESET_POS)
#define CLKRST_REG_CTRL_CPU_RESET_UMSK                          (~(((1U<<CLKRST_REG_CTRL_CPU_RESET_LEN)-1)<<CLKRST_REG_CTRL_CPU_RESET_POS))
#define CLKRST_REG_CTRL_PWRON_RST                               CLKRST_REG_CTRL_PWRON_RST
#define CLKRST_REG_CTRL_PWRON_RST_POS                           (2U)
#define CLKRST_REG_CTRL_PWRON_RST_LEN                           (1U)
#define CLKRST_REG_CTRL_PWRON_RST_MSK                           (((1U<<CLKRST_REG_CTRL_PWRON_RST_LEN)-1)<<CLKRST_REG_CTRL_PWRON_RST_POS)
#define CLKRST_REG_CTRL_PWRON_RST_UMSK                          (~(((1U<<CLKRST_REG_CTRL_PWRON_RST_LEN)-1)<<CLKRST_REG_CTRL_PWRON_RST_POS))
#define CLKRST_REG_CTRL_A5_CPU_RESET                            CLKRST_REG_CTRL_A5_CPU_RESET
#define CLKRST_REG_CTRL_A5_CPU_RESET_POS                        (8U)
#define CLKRST_REG_CTRL_A5_CPU_RESET_LEN                        (1U)
#define CLKRST_REG_CTRL_A5_CPU_RESET_MSK                        (((1U<<CLKRST_REG_CTRL_A5_CPU_RESET_LEN)-1)<<CLKRST_REG_CTRL_A5_CPU_RESET_POS)
#define CLKRST_REG_CTRL_A5_CPU_RESET_UMSK                       (~(((1U<<CLKRST_REG_CTRL_A5_CPU_RESET_LEN)-1)<<CLKRST_REG_CTRL_A5_CPU_RESET_POS))
#define CLKRST_REG_CTRL_A5_DBG_RESET                            CLKRST_REG_CTRL_A5_DBG_RESET
#define CLKRST_REG_CTRL_A5_DBG_RESET_POS                        (9U)
#define CLKRST_REG_CTRL_A5_DBG_RESET_LEN                        (1U)
#define CLKRST_REG_CTRL_A5_DBG_RESET_MSK                        (((1U<<CLKRST_REG_CTRL_A5_DBG_RESET_LEN)-1)<<CLKRST_REG_CTRL_A5_DBG_RESET_POS)
#define CLKRST_REG_CTRL_A5_DBG_RESET_UMSK                       (~(((1U<<CLKRST_REG_CTRL_A5_DBG_RESET_LEN)-1)<<CLKRST_REG_CTRL_A5_DBG_RESET_POS))
#define CLKRST_REG_CTRL_A5_PERI_RESET                           CLKRST_REG_CTRL_A5_PERI_RESET
#define CLKRST_REG_CTRL_A5_PERI_RESET_POS                       (10U)
#define CLKRST_REG_CTRL_A5_PERI_RESET_LEN                       (1U)
#define CLKRST_REG_CTRL_A5_PERI_RESET_MSK                       (((1U<<CLKRST_REG_CTRL_A5_PERI_RESET_LEN)-1)<<CLKRST_REG_CTRL_A5_PERI_RESET_POS)
#define CLKRST_REG_CTRL_A5_PERI_RESET_UMSK                      (~(((1U<<CLKRST_REG_CTRL_A5_PERI_RESET_LEN)-1)<<CLKRST_REG_CTRL_A5_PERI_RESET_POS))
#define CLKRST_REG_CTRL_A5_SCU_RESET                            CLKRST_REG_CTRL_A5_SCU_RESET
#define CLKRST_REG_CTRL_A5_SCU_RESET_POS                        (11U)
#define CLKRST_REG_CTRL_A5_SCU_RESET_LEN                        (1U)
#define CLKRST_REG_CTRL_A5_SCU_RESET_MSK                        (((1U<<CLKRST_REG_CTRL_A5_SCU_RESET_LEN)-1)<<CLKRST_REG_CTRL_A5_SCU_RESET_POS)
#define CLKRST_REG_CTRL_A5_SCU_RESET_UMSK                       (~(((1U<<CLKRST_REG_CTRL_A5_SCU_RESET_LEN)-1)<<CLKRST_REG_CTRL_A5_SCU_RESET_POS))
#define CLKRST_REG_CTRL_A5_WDT_RESET                            CLKRST_REG_CTRL_A5_WDT_RESET
#define CLKRST_REG_CTRL_A5_WDT_RESET_POS                        (12U)
#define CLKRST_REG_CTRL_A5_WDT_RESET_LEN                        (1U)
#define CLKRST_REG_CTRL_A5_WDT_RESET_MSK                        (((1U<<CLKRST_REG_CTRL_A5_WDT_RESET_LEN)-1)<<CLKRST_REG_CTRL_A5_WDT_RESET_POS)
#define CLKRST_REG_CTRL_A5_WDT_RESET_UMSK                       (~(((1U<<CLKRST_REG_CTRL_A5_WDT_RESET_LEN)-1)<<CLKRST_REG_CTRL_A5_WDT_RESET_POS))
#define CLKRST_REG_CTRL_E74_RESET                               CLKRST_REG_CTRL_E74_RESET
#define CLKRST_REG_CTRL_E74_RESET_POS                           (16U)
#define CLKRST_REG_CTRL_E74_RESET_LEN                           (1U)
#define CLKRST_REG_CTRL_E74_RESET_MSK                           (((1U<<CLKRST_REG_CTRL_E74_RESET_LEN)-1)<<CLKRST_REG_CTRL_E74_RESET_POS)
#define CLKRST_REG_CTRL_E74_RESET_UMSK                          (~(((1U<<CLKRST_REG_CTRL_E74_RESET_LEN)-1)<<CLKRST_REG_CTRL_E74_RESET_POS))

