bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/clkrst_reg.h
/* 0x44 : sw_reset_mm_peri */
#define CLKRST_SW_RESET_MM_PERI_OFFSET                          (0x44)
#define CLKRST_SWRST_MM_MISC                                    CLKRST_SWRST_MM_MISC
#define CLKRST_SWRST_MM_MISC_POS                                (0U)
#define CLKRST_SWRST_MM_MISC_LEN                                (1U)
#define CLKRST_SWRST_MM_MISC_MSK                                (((1U<<CLKRST_SWRST_MM_MISC_LEN)-1)<<CLKRST_SWRST_MM_MISC_POS)
#define CLKRST_SWRST_MM_MISC_UMSK                               (~(((1U<<CLKRST_SWRST_MM_MISC_LEN)-1)<<CLKRST_SWRST_MM_MISC_POS))
#define CLKRST_SWRST_DMA                                        CLKRST_SWRST_DMA
#define CLKRST_SWRST_DMA_POS                                    (1U)
#define CLKRST_SWRST_DMA_LEN                                    (1U)
#define CLKRST_SWRST_DMA_MSK                                    (((1U<<CLKRST_SWRST_DMA_LEN)-1)<<CLKRST_SWRST_DMA_POS)
#define CLKRST_SWRST_DMA_UMSK                                   (~(((1U<<CLKRST_SWRST_DMA_LEN)-1)<<CLKRST_SWRST_DMA_POS))
#define CLKRST_SWRST_UART                                       CLKRST_SWRST_UART
#define CLKRST_SWRST_UART_POS                                   (2U)
#define CLKRST_SWRST_UART_LEN                                   (1U)
#define CLKRST_SWRST_UART_MSK                                   (((1U<<CLKRST_SWRST_UART_LEN)-1)<<CLKRST_SWRST_UART_POS)
#define CLKRST_SWRST_UART_UMSK                                  (~(((1U<<CLKRST_SWRST_UART_LEN)-1)<<CLKRST_SWRST_UART_POS))
#define CLKRST_SWRST_I2CA                                       CLKRST_SWRST_I2CA
#define CLKRST_SWRST_I2CA_POS                                   (3U)
#define CLKRST_SWRST_I2CA_LEN                                   (1U)
#define CLKRST_SWRST_I2CA_MSK                                   (((1U<<CLKRST_SWRST_I2CA_LEN)-1)<<CLKRST_SWRST_I2CA_POS)
#define CLKRST_SWRST_I2CA_UMSK                                  (~(((1U<<CLKRST_SWRST_I2CA_LEN)-1)<<CLKRST_SWRST_I2CA_POS))
#define CLKRST_SWRST_I2CB                                       CLKRST_SWRST_I2CB
#define CLKRST_SWRST_I2CB_POS                                   (4U)
#define CLKRST_SWRST_I2CB_LEN                                   (1U)
#define CLKRST_SWRST_I2CB_MSK                                   (((1U<<CLKRST_SWRST_I2CB_LEN)-1)<<CLKRST_SWRST_I2CB_POS)
#define CLKRST_SWRST_I2CB_UMSK                                  (~(((1U<<CLKRST_SWRST_I2CB_LEN)-1)<<CLKRST_SWRST_I2CB_POS))
#define CLKRST_SWRST_PSRAMA                                     CLKRST_SWRST_PSRAMA
#define CLKRST_SWRST_PSRAMA_POS                                 (5U)
#define CLKRST_SWRST_PSRAMA_LEN                                 (1U)
#define CLKRST_SWRST_PSRAMA_MSK                                 (((1U<<CLKRST_SWRST_PSRAMA_LEN)-1)<<CLKRST_SWRST_PSRAMA_POS)
#define CLKRST_SWRST_PSRAMA_UMSK                                (~(((1U<<CLKRST_SWRST_PSRAMA_LEN)-1)<<CLKRST_SWRST_PSRAMA_POS))
#define CLKRST_SWRST_PSRAMB                                     CLKRST_SWRST_PSRAMB
#define CLKRST_SWRST_PSRAMB_POS                                 (6U)
#define CLKRST_SWRST_PSRAMB_LEN                                 (1U)
#define CLKRST_SWRST_PSRAMB_MSK                                 (((1U<<CLKRST_SWRST_PSRAMB_LEN)-1)<<CLKRST_SWRST_PSRAMB_POS)
#define CLKRST_SWRST_PSRAMB_UMSK                                (~(((1U<<CLKRST_SWRST_PSRAMB_LEN)-1)<<CLKRST_SWRST_PSRAMB_POS))
#define CLKRST_SWRST_SPI                                        CLKRST_SWRST_SPI
#define CLKRST_SWRST_SPI_POS                                    (8U)
#define CLKRST_SWRST_SPI_LEN                                    (1U)
#define CLKRST_SWRST_SPI_MSK                                    (((1U<<CLKRST_SWRST_SPI_LEN)-1)<<CLKRST_SWRST_SPI_POS)
#define CLKRST_SWRST_SPI_UMSK                                   (~(((1U<<CLKRST_SWRST_SPI_LEN)-1)<<CLKRST_SWRST_SPI_POS))
#define CLKRST_SWRST_CCI                                        CLKRST_SWRST_CCI
#define CLKRST_SWRST_CCI_POS                                    (9U)
#define CLKRST_SWRST_CCI_LEN                                    (1U)
#define CLKRST_SWRST_CCI_MSK                                    (((1U<<CLKRST_SWRST_CCI_LEN)-1)<<CLKRST_SWRST_CCI_POS)
#define CLKRST_SWRST_CCI_UMSK                                   (~(((1U<<CLKRST_SWRST_CCI_LEN)-1)<<CLKRST_SWRST_CCI_POS))
#define CLKRST_SWRST_I2S0                                       CLKRST_SWRST_I2S0
#define CLKRST_SWRST_I2S0_POS                                   (10U)
#define CLKRST_SWRST_I2S0_LEN                                   (1U)
#define CLKRST_SWRST_I2S0_MSK                                   (((1U<<CLKRST_SWRST_I2S0_LEN)-1)<<CLKRST_SWRST_I2S0_POS)
#define CLKRST_SWRST_I2S0_UMSK                                  (~(((1U<<CLKRST_SWRST_I2S0_LEN)-1)<<CLKRST_SWRST_I2S0_POS))
#define CLKRST_SWRST_I2S1                                       CLKRST_SWRST_I2S1
#define CLKRST_SWRST_I2S1_POS                                   (11U)
#define CLKRST_SWRST_I2S1_LEN                                   (1U)
#define CLKRST_SWRST_I2S1_MSK                                   (((1U<<CLKRST_SWRST_I2S1_LEN)-1)<<CLKRST_SWRST_I2S1_POS)
#define CLKRST_SWRST_I2S1_UMSK                                  (~(((1U<<CLKRST_SWRST_I2S1_LEN)-1)<<CLKRST_SWRST_I2S1_POS))
#define CLKRST_SWRST_PDM0                                       CLKRST_SWRST_PDM0
#define CLKRST_SWRST_PDM0_POS                                   (12U)
#define CLKRST_SWRST_PDM0_LEN                                   (1U)
#define CLKRST_SWRST_PDM0_MSK                                   (((1U<<CLKRST_SWRST_PDM0_LEN)-1)<<CLKRST_SWRST_PDM0_POS)
#define CLKRST_SWRST_PDM0_UMSK                                  (~(((1U<<CLKRST_SWRST_PDM0_LEN)-1)<<CLKRST_SWRST_PDM0_POS))
#define CLKRST_SWRST_PDM1                                       CLKRST_SWRST_PDM1
#define CLKRST_SWRST_PDM1_POS                                   (13U)
#define CLKRST_SWRST_PDM1_LEN                                   (1U)
#define CLKRST_SWRST_PDM1_MSK                                   (((1U<<CLKRST_SWRST_PDM1_LEN)-1)<<CLKRST_SWRST_PDM1_POS)
#define CLKRST_SWRST_PDM1_UMSK                                  (~(((1U<<CLKRST_SWRST_PDM1_LEN)-1)<<CLKRST_SWRST_PDM1_POS))
#define CLKRST_SWRST_SDH                                        CLKRST_SWRST_SDH
#define CLKRST_SWRST_SDH_POS                                    (16U)
#define CLKRST_SWRST_SDH_LEN                                    (1U)
#define CLKRST_SWRST_SDH_MSK                                    (((1U<<CLKRST_SWRST_SDH_LEN)-1)<<CLKRST_SWRST_SDH_POS)
#define CLKRST_SWRST_SDH_UMSK                                   (~(((1U<<CLKRST_SWRST_SDH_LEN)-1)<<CLKRST_SWRST_SDH_POS))
#define CLKRST_SWRST_ETH                                        CLKRST_SWRST_ETH
#define CLKRST_SWRST_ETH_POS                                    (24U)
#define CLKRST_SWRST_ETH_LEN                                    (1U)
#define CLKRST_SWRST_ETH_MSK                                    (((1U<<CLKRST_SWRST_ETH_LEN)-1)<<CLKRST_SWRST_ETH_POS)
#define CLKRST_SWRST_ETH_UMSK                                   (~(((1U<<CLKRST_SWRST_ETH_LEN)-1)<<CLKRST_SWRST_ETH_POS))

