bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/clkrst_reg.h
/* 0x48 : sw_reset_spp_sub */
#define CLKRST_SW_RESET_SPP_SUB_OFFSET                          (0x48)
#define CLKRST_SWRST_SPP_MISC                                   CLKRST_SWRST_SPP_MISC
#define CLKRST_SWRST_SPP_MISC_POS                               (0U)
#define CLKRST_SWRST_SPP_MISC_LEN                               (1U)
#define CLKRST_SWRST_SPP_MISC_MSK                               (((1U<<CLKRST_SWRST_SPP_MISC_LEN)-1)<<CLKRST_SWRST_SPP_MISC_POS)
#define CLKRST_SWRST_SPP_MISC_UMSK                              (~(((1U<<CLKRST_SWRST_SPP_MISC_LEN)-1)<<CLKRST_SWRST_SPP_MISC_POS))
#define CLKRST_SWRST_SPP_MAIN                                   CLKRST_SWRST_SPP_MAIN
#define CLKRST_SWRST_SPP_MAIN_POS                               (1U)
#define CLKRST_SWRST_SPP_MAIN_LEN                               (1U)
#define CLKRST_SWRST_SPP_MAIN_MSK                               (((1U<<CLKRST_SWRST_SPP_MAIN_LEN)-1)<<CLKRST_SWRST_SPP_MAIN_POS)
#define CLKRST_SWRST_SPP_MAIN_UMSK                              (~(((1U<<CLKRST_SWRST_SPP_MAIN_LEN)-1)<<CLKRST_SWRST_SPP_MAIN_POS))
#define CLKRST_SWRST_SPP_TSRC                                   CLKRST_SWRST_SPP_TSRC
#define CLKRST_SWRST_SPP_TSRC_POS                               (2U)
#define CLKRST_SWRST_SPP_TSRC_LEN                               (1U)
#define CLKRST_SWRST_SPP_TSRC_MSK                               (((1U<<CLKRST_SWRST_SPP_TSRC_LEN)-1)<<CLKRST_SWRST_SPP_TSRC_POS)
#define CLKRST_SWRST_SPP_TSRC_UMSK                              (~(((1U<<CLKRST_SWRST_SPP_TSRC_LEN)-1)<<CLKRST_SWRST_SPP_TSRC_POS))
#define CLKRST_SWRST_HDMI_TSRC                                  CLKRST_SWRST_HDMI_TSRC
#define CLKRST_SWRST_HDMI_TSRC_POS                              (3U)
#define CLKRST_SWRST_HDMI_TSRC_LEN                              (1U)
#define CLKRST_SWRST_HDMI_TSRC_MSK                              (((1U<<CLKRST_SWRST_HDMI_TSRC_LEN)-1)<<CLKRST_SWRST_HDMI_TSRC_POS)
#define CLKRST_SWRST_HDMI_TSRC_UMSK                             (~(((1U<<CLKRST_SWRST_HDMI_TSRC_LEN)-1)<<CLKRST_SWRST_HDMI_TSRC_POS))
#define CLKRST_SWRST_NR3D_CTRL                                  CLKRST_SWRST_NR3D_CTRL
#define CLKRST_SWRST_NR3D_CTRL_POS                              (4U)
#define CLKRST_SWRST_NR3D_CTRL_LEN                              (1U)
#define CLKRST_SWRST_NR3D_CTRL_MSK                              (((1U<<CLKRST_SWRST_NR3D_CTRL_LEN)-1)<<CLKRST_SWRST_NR3D_CTRL_POS)
#define CLKRST_SWRST_NR3D_CTRL_UMSK                             (~(((1U<<CLKRST_SWRST_NR3D_CTRL_LEN)-1)<<CLKRST_SWRST_NR3D_CTRL_POS))
#define CLKRST_SWRST_DVP2BUSA                                   CLKRST_SWRST_DVP2BUSA
#define CLKRST_SWRST_DVP2BUSA_POS                               (5U)
#define CLKRST_SWRST_DVP2BUSA_LEN                               (1U)
#define CLKRST_SWRST_DVP2BUSA_MSK                               (((1U<<CLKRST_SWRST_DVP2BUSA_LEN)-1)<<CLKRST_SWRST_DVP2BUSA_POS)
#define CLKRST_SWRST_DVP2BUSA_UMSK                              (~(((1U<<CLKRST_SWRST_DVP2BUSA_LEN)-1)<<CLKRST_SWRST_DVP2BUSA_POS))
#define CLKRST_SWRST_DVP2BUSB                                   CLKRST_SWRST_DVP2BUSB
#define CLKRST_SWRST_DVP2BUSB_POS                               (6U)
#define CLKRST_SWRST_DVP2BUSB_LEN                               (1U)
#define CLKRST_SWRST_DVP2BUSB_MSK                               (((1U<<CLKRST_SWRST_DVP2BUSB_LEN)-1)<<CLKRST_SWRST_DVP2BUSB_POS)
#define CLKRST_SWRST_DVP2BUSB_UMSK                              (~(((1U<<CLKRST_SWRST_DVP2BUSB_LEN)-1)<<CLKRST_SWRST_DVP2BUSB_POS))
#define CLKRST_SWRST_DVP2BUSC                                   CLKRST_SWRST_DVP2BUSC
#define CLKRST_SWRST_DVP2BUSC_POS                               (7U)
#define CLKRST_SWRST_DVP2BUSC_LEN                               (1U)
#define CLKRST_SWRST_DVP2BUSC_MSK                               (((1U<<CLKRST_SWRST_DVP2BUSC_LEN)-1)<<CLKRST_SWRST_DVP2BUSC_POS)
#define CLKRST_SWRST_DVP2BUSC_UMSK                              (~(((1U<<CLKRST_SWRST_DVP2BUSC_LEN)-1)<<CLKRST_SWRST_DVP2BUSC_POS))
#define CLKRST_SWRST_DVP2BUSD                                   CLKRST_SWRST_DVP2BUSD
#define CLKRST_SWRST_DVP2BUSD_POS                               (8U)
#define CLKRST_SWRST_DVP2BUSD_LEN                               (1U)
#define CLKRST_SWRST_DVP2BUSD_MSK                               (((1U<<CLKRST_SWRST_DVP2BUSD_LEN)-1)<<CLKRST_SWRST_DVP2BUSD_POS)
#define CLKRST_SWRST_DVP2BUSD_UMSK                              (~(((1U<<CLKRST_SWRST_DVP2BUSD_LEN)-1)<<CLKRST_SWRST_DVP2BUSD_POS))
#define CLKRST_SWRST_SPP_REG                                    CLKRST_SWRST_SPP_REG
#define CLKRST_SWRST_SPP_REG_POS                                (16U)
#define CLKRST_SWRST_SPP_REG_LEN                                (1U)
#define CLKRST_SWRST_SPP_REG_MSK                                (((1U<<CLKRST_SWRST_SPP_REG_LEN)-1)<<CLKRST_SWRST_SPP_REG_POS)
#define CLKRST_SWRST_SPP_REG_UMSK                               (~(((1U<<CLKRST_SWRST_SPP_REG_LEN)-1)<<CLKRST_SWRST_SPP_REG_POS))

/* 0x4C : sw_reset_codec_sub */
#define CLKRST_SW_RESET_CODEC_SUB_OFFSET                        (0x4C)
#define CLKRST_SWRST_CODEC_MISC                                 CLKRST_SWRST_CODEC_MISC
#define CLKRST_SWRST_CODEC_MISC_POS                             (0U)
#define CLKRST_SWRST_CODEC_MISC_LEN                             (1U)
#define CLKRST_SWRST_CODEC_MISC_MSK                             (((1U<<CLKRST_SWRST_CODEC_MISC_LEN)-1)<<CLKRST_SWRST_CODEC_MISC_POS)
#define CLKRST_SWRST_CODEC_MISC_UMSK                            (~(((1U<<CLKRST_SWRST_CODEC_MISC_LEN)-1)<<CLKRST_SWRST_CODEC_MISC_POS))
#define CLKRST_SWRST_MJPEG                                      CLKRST_SWRST_MJPEG
#define CLKRST_SWRST_MJPEG_POS                                  (1U)
#define CLKRST_SWRST_MJPEG_LEN                                  (1U)
#define CLKRST_SWRST_MJPEG_MSK                                  (((1U<<CLKRST_SWRST_MJPEG_LEN)-1)<<CLKRST_SWRST_MJPEG_POS)
#define CLKRST_SWRST_MJPEG_UMSK                                 (~(((1U<<CLKRST_SWRST_MJPEG_LEN)-1)<<CLKRST_SWRST_MJPEG_POS))
#define CLKRST_SWRST_H264                                       CLKRST_SWRST_H264
#define CLKRST_SWRST_H264_POS                                   (2U)
#define CLKRST_SWRST_H264_LEN                                   (1U)
#define CLKRST_SWRST_H264_MSK                                   (((1U<<CLKRST_SWRST_H264_LEN)-1)<<CLKRST_SWRST_H264_POS)
#define CLKRST_SWRST_H264_UMSK                                  (~(((1U<<CLKRST_SWRST_H264_LEN)-1)<<CLKRST_SWRST_H264_POS))
#define CLKRST_SWRST_MJPEGDEC                                   CLKRST_SWRST_MJPEGDEC
#define CLKRST_SWRST_MJPEGDEC_POS                               (3U)
#define CLKRST_SWRST_MJPEGDEC_LEN                               (1U)
#define CLKRST_SWRST_MJPEGDEC_MSK                               (((1U<<CLKRST_SWRST_MJPEG_LEN)-1)<<CLKRST_SWRST_MJPEG_POS)
#define CLKRST_SWRST_MJPEGDEC_UMSK                              (~(((1U<<CLKRST_SWRST_MJPEG_LEN)-1)<<CLKRST_SWRST_MJPEG_POS))
#define CLKRST_SWRST_NPU                                        CLKRST_SWRST_NPU
#define CLKRST_SWRST_NPU_POS                                    (4U)
#define CLKRST_SWRST_NPU_LEN                                    (1U)
#define CLKRST_SWRST_NPU_MSK                                    (((1U<<CLKRST_SWRST_NPU_LEN)-1)<<CLKRST_SWRST_NPU_POS)
#define CLKRST_SWRST_NPU_UMSK                                   (~(((1U<<CLKRST_SWRST_NPU_LEN)-1)<<CLKRST_SWRST_NPU_POS))

#define CLKRST_SWRST_VRAM                                       CLKRST_SWRST_VRAM
#define CLKRST_SWRST_VRAM_POS                                   (16U)
#define CLKRST_SWRST_VRAM_LEN                                   (1U)
#define CLKRST_SWRST_VRAM_MSK                                   (((1U<<CLKRST_SWRST_VRAM_LEN)-1)<<CLKRST_SWRST_VRAM_POS)
#define CLKRST_SWRST_VRAM_UMSK                                  (~(((1U<<CLKRST_SWRST_VRAM_LEN)-1)<<CLKRST_SWRST_VRAM_POS))

/* 0x50 : image_sensor_ctrl */
#define CLKRST_IMAGE_SENSOR_CTRL_OFFSET                         (0x50)
#define CLKRST_RG_IS_RST_N                                      CLKRST_RG_IS_RST_N
#define CLKRST_RG_IS_RST_N_POS                                  (0U)
#define CLKRST_RG_IS_RST_N_LEN                                  (1U)
#define CLKRST_RG_IS_RST_N_MSK                                  (((1U<<CLKRST_RG_IS_RST_N_LEN)-1)<<CLKRST_RG_IS_RST_N_POS)
#define CLKRST_RG_IS_RST_N_UMSK                                 (~(((1U<<CLKRST_RG_IS_RST_N_LEN)-1)<<CLKRST_RG_IS_RST_N_POS))

/* 0x60 : sw_reset_mask */
#define CLKRST_SW_RESET_MASK_OFFSET                             (0x60)
#define CLKRST_REG_RST_MASK_A5SYS_TO_SYS                        CLKRST_REG_RST_MASK_A5SYS_TO_SYS
#define CLKRST_REG_RST_MASK_A5SYS_TO_SYS_POS                    (0U)
#define CLKRST_REG_RST_MASK_A5SYS_TO_SYS_LEN                    (1U)
#define CLKRST_REG_RST_MASK_A5SYS_TO_SYS_MSK                    (((1U<<CLKRST_REG_RST_MASK_A5SYS_TO_SYS_LEN)-1)<<CLKRST_REG_RST_MASK_A5SYS_TO_SYS_POS)
#define CLKRST_REG_RST_MASK_A5SYS_TO_SYS_UMSK                   (~(((1U<<CLKRST_REG_RST_MASK_A5SYS_TO_SYS_LEN)-1)<<CLKRST_REG_RST_MASK_A5SYS_TO_SYS_POS))
#define CLKRST_REG_RST_MASK_A5WDT_TO_SYS                        CLKRST_REG_RST_MASK_A5WDT_TO_SYS
#define CLKRST_REG_RST_MASK_A5WDT_TO_SYS_POS                    (1U)
#define CLKRST_REG_RST_MASK_A5WDT_TO_SYS_LEN                    (1U)
#define CLKRST_REG_RST_MASK_A5WDT_TO_SYS_MSK                    (((1U<<CLKRST_REG_RST_MASK_A5WDT_TO_SYS_LEN)-1)<<CLKRST_REG_RST_MASK_A5WDT_TO_SYS_POS)
#define CLKRST_REG_RST_MASK_A5WDT_TO_SYS_UMSK                   (~(((1U<<CLKRST_REG_RST_MASK_A5WDT_TO_SYS_LEN)-1)<<CLKRST_REG_RST_MASK_A5WDT_TO_SYS_POS))
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5CPU                      CLKRST_REG_RST_MASK_A5SYS_TO_A5CPU
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5CPU_POS                  (2U)
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5CPU_LEN                  (1U)
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5CPU_MSK                  (((1U<<CLKRST_REG_RST_MASK_A5SYS_TO_A5CPU_LEN)-1)<<CLKRST_REG_RST_MASK_A5SYS_TO_A5CPU_POS)
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5CPU_UMSK                 (~(((1U<<CLKRST_REG_RST_MASK_A5SYS_TO_A5CPU_LEN)-1)<<CLKRST_REG_RST_MASK_A5SYS_TO_A5CPU_POS))
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5CPU                      CLKRST_REG_RST_MASK_A5WDT_TO_A5CPU
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5CPU_POS                  (3U)
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5CPU_LEN                  (1U)
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5CPU_MSK                  (((1U<<CLKRST_REG_RST_MASK_A5WDT_TO_A5CPU_LEN)-1)<<CLKRST_REG_RST_MASK_A5WDT_TO_A5CPU_POS)
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5CPU_UMSK                 (~(((1U<<CLKRST_REG_RST_MASK_A5WDT_TO_A5CPU_LEN)-1)<<CLKRST_REG_RST_MASK_A5WDT_TO_A5CPU_POS))
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5DBG                      CLKRST_REG_RST_MASK_A5SYS_TO_A5DBG
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5DBG_POS                  (4U)
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5DBG_LEN                  (1U)
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5DBG_MSK                  (((1U<<CLKRST_REG_RST_MASK_A5SYS_TO_A5DBG_LEN)-1)<<CLKRST_REG_RST_MASK_A5SYS_TO_A5DBG_POS)
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5DBG_UMSK                 (~(((1U<<CLKRST_REG_RST_MASK_A5SYS_TO_A5DBG_LEN)-1)<<CLKRST_REG_RST_MASK_A5SYS_TO_A5DBG_POS))
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5DBG                      CLKRST_REG_RST_MASK_A5WDT_TO_A5DBG
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5DBG_POS                  (5U)
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5DBG_LEN                  (1U)
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5DBG_MSK                  (((1U<<CLKRST_REG_RST_MASK_A5WDT_TO_A5DBG_LEN)-1)<<CLKRST_REG_RST_MASK_A5WDT_TO_A5DBG_POS)
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5DBG_UMSK                 (~(((1U<<CLKRST_REG_RST_MASK_A5WDT_TO_A5DBG_LEN)-1)<<CLKRST_REG_RST_MASK_A5WDT_TO_A5DBG_POS))
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5PERI                     CLKRST_REG_RST_MASK_A5SYS_TO_A5PERI
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5PERI_POS                 (6U)
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5PERI_LEN                 (1U)
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5PERI_MSK                 (((1U<<CLKRST_REG_RST_MASK_A5SYS_TO_A5PERI_LEN)-1)<<CLKRST_REG_RST_MASK_A5SYS_TO_A5PERI_POS)
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5PERI_UMSK                (~(((1U<<CLKRST_REG_RST_MASK_A5SYS_TO_A5PERI_LEN)-1)<<CLKRST_REG_RST_MASK_A5SYS_TO_A5PERI_POS))
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5PERI                     CLKRST_REG_RST_MASK_A5WDT_TO_A5PERI
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5PERI_POS                 (7U)
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5PERI_LEN                 (1U)
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5PERI_MSK                 (((1U<<CLKRST_REG_RST_MASK_A5WDT_TO_A5PERI_LEN)-1)<<CLKRST_REG_RST_MASK_A5WDT_TO_A5PERI_POS)
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5PERI_UMSK                (~(((1U<<CLKRST_REG_RST_MASK_A5WDT_TO_A5PERI_LEN)-1)<<CLKRST_REG_RST_MASK_A5WDT_TO_A5PERI_POS))
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5SCU                      CLKRST_REG_RST_MASK_A5SYS_TO_A5SCU
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5SCU_POS                  (8U)
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5SCU_LEN                  (1U)
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5SCU_MSK                  (((1U<<CLKRST_REG_RST_MASK_A5SYS_TO_A5SCU_LEN)-1)<<CLKRST_REG_RST_MASK_A5SYS_TO_A5SCU_POS)
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5SCU_UMSK                 (~(((1U<<CLKRST_REG_RST_MASK_A5SYS_TO_A5SCU_LEN)-1)<<CLKRST_REG_RST_MASK_A5SYS_TO_A5SCU_POS))
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5SCU                      CLKRST_REG_RST_MASK_A5WDT_TO_A5SCU
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5SCU_POS                  (9U)
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5SCU_LEN                  (1U)
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5SCU_MSK                  (((1U<<CLKRST_REG_RST_MASK_A5WDT_TO_A5SCU_LEN)-1)<<CLKRST_REG_RST_MASK_A5WDT_TO_A5SCU_POS)
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5SCU_UMSK                 (~(((1U<<CLKRST_REG_RST_MASK_A5WDT_TO_A5SCU_LEN)-1)<<CLKRST_REG_RST_MASK_A5WDT_TO_A5SCU_POS))
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5WDT                      CLKRST_REG_RST_MASK_A5SYS_TO_A5WDT
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5WDT_POS                  (10U)
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5WDT_LEN                  (1U)
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5WDT_MSK                  (((1U<<CLKRST_REG_RST_MASK_A5SYS_TO_A5WDT_LEN)-1)<<CLKRST_REG_RST_MASK_A5SYS_TO_A5WDT_POS)
#define CLKRST_REG_RST_MASK_A5SYS_TO_A5WDT_UMSK                 (~(((1U<<CLKRST_REG_RST_MASK_A5SYS_TO_A5WDT_LEN)-1)<<CLKRST_REG_RST_MASK_A5SYS_TO_A5WDT_POS))
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5WDT                      CLKRST_REG_RST_MASK_A5WDT_TO_A5WDT
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5WDT_POS                  (11U)
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5WDT_LEN                  (1U)
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5WDT_MSK                  (((1U<<CLKRST_REG_RST_MASK_A5WDT_TO_A5WDT_LEN)-1)<<CLKRST_REG_RST_MASK_A5WDT_TO_A5WDT_POS)
#define CLKRST_REG_RST_MASK_A5WDT_TO_A5WDT_UMSK                 (~(((1U<<CLKRST_REG_RST_MASK_A5WDT_TO_A5WDT_LEN)-1)<<CLKRST_REG_RST_MASK_A5WDT_TO_A5WDT_POS))
#define CLKRST_REG_RST_MASK_E74_TO_SYS                          CLKRST_REG_RST_MASK_E74_TO_SYS
#define CLKRST_REG_RST_MASK_E74_TO_SYS_POS                      (12U)
#define CLKRST_REG_RST_MASK_E74_TO_SYS_LEN                      (1U)
#define CLKRST_REG_RST_MASK_E74_TO_SYS_MSK                      (((1U<<CLKRST_REG_RST_MASK_E74_TO_SYS_LEN)-1)<<CLKRST_REG_RST_MASK_E74_TO_SYS_POS)
#define CLKRST_REG_RST_MASK_E74_TO_SYS_UMSK                     (~(((1U<<CLKRST_REG_RST_MASK_E74_TO_SYS_LEN)-1)<<CLKRST_REG_RST_MASK_E74_TO_SYS_POS))
#define CLKRST_REG_RST_MASK_E74_TO_E74                          CLKRST_REG_RST_MASK_E74_TO_E74
#define CLKRST_REG_RST_MASK_E74_TO_E74_POS                      (13U)
#define CLKRST_REG_RST_MASK_E74_TO_E74_LEN                      (1U)
#define CLKRST_REG_RST_MASK_E74_TO_E74_MSK                      (((1U<<CLKRST_REG_RST_MASK_E74_TO_E74_LEN)-1)<<CLKRST_REG_RST_MASK_E74_TO_E74_POS)
#define CLKRST_REG_RST_MASK_E74_TO_E74_UMSK                     (~(((1U<<CLKRST_REG_RST_MASK_E74_TO_E74_LEN)-1)<<CLKRST_REG_RST_MASK_E74_TO_E74_POS))

/* 0x80 : SYS_TICK_CFG */
#define CLKRST_SYS_TICK_CFG_OFFSET                              (0x80)
#define CLKRST_STCALIB                                          CLKRST_STCALIB
#define CLKRST_STCALIB_POS                                      (0U)
#define CLKRST_STCALIB_LEN                                      (26U)
#define CLKRST_STCALIB_MSK                                      (((1U<<CLKRST_STCALIB_LEN)-1)<<CLKRST_STCALIB_POS)
#define CLKRST_STCALIB_UMSK                                     (~(((1U<<CLKRST_STCALIB_LEN)-1)<<CLKRST_STCALIB_POS))

/* 0x100 : clkpll register 1 */
#define CLKRST_CLKIP1_OFFSET                                    (0x100)
#define CLKRST_CLKPLL_PPU                                       CLKRST_CLKPLL_PPU
#define CLKRST_CLKPLL_PPU_POS                                   (0U)
#define CLKRST_CLKPLL_PPU_LEN                                   (1U)
#define CLKRST_CLKPLL_PPU_MSK                                   (((1U<<CLKRST_CLKPLL_PPU_LEN)-1)<<CLKRST_CLKPLL_PPU_POS)
#define CLKRST_CLKPLL_PPU_UMSK                                  (~(((1U<<CLKRST_CLKPLL_PPU_LEN)-1)<<CLKRST_CLKPLL_PPU_POS))
#define CLKRST_CLKPLL_PU                                        CLKRST_CLKPLL_PU
#define CLKRST_CLKPLL_PU_POS                                    (1U)
#define CLKRST_CLKPLL_PU_LEN                                    (1U)
#define CLKRST_CLKPLL_PU_MSK                                    (((1U<<CLKRST_CLKPLL_PU_LEN)-1)<<CLKRST_CLKPLL_PU_POS)
#define CLKRST_CLKPLL_PU_UMSK                                   (~(((1U<<CLKRST_CLKPLL_PU_LEN)-1)<<CLKRST_CLKPLL_PU_POS))
#define CLKRST_CLKPLL2_PPU                                      CLKRST_CLKPLL2_PPU
#define CLKRST_CLKPLL2_PPU_POS                                  (2U)
#define CLKRST_CLKPLL2_PPU_LEN                                  (1U)
#define CLKRST_CLKPLL2_PPU_MSK                                  (((1U<<CLKRST_CLKPLL2_PPU_LEN)-1)<<CLKRST_CLKPLL2_PPU_POS)
#define CLKRST_CLKPLL2_PPU_UMSK                                 (~(((1U<<CLKRST_CLKPLL2_PPU_LEN)-1)<<CLKRST_CLKPLL2_PPU_POS))
#define CLKRST_CLKPLL2_PU                                       CLKRST_CLKPLL2_PU
#define CLKRST_CLKPLL2_PU_POS                                   (3U)
#define CLKRST_CLKPLL2_PU_LEN                                   (1U)
#define CLKRST_CLKPLL2_PU_MSK                                   (((1U<<CLKRST_CLKPLL2_PU_LEN)-1)<<CLKRST_CLKPLL2_PU_POS)
#define CLKRST_CLKPLL2_PU_UMSK                                  (~(((1U<<CLKRST_CLKPLL2_PU_LEN)-1)<<CLKRST_CLKPLL2_PU_POS))
#define CLKRST_TEN_CLKPLL                                       CLKRST_TEN_CLKPLL
#define CLKRST_TEN_CLKPLL_POS                                   (4U)
#define CLKRST_TEN_CLKPLL_LEN                                   (3U)
#define CLKRST_TEN_CLKPLL_MSK                                   (((1U<<CLKRST_TEN_CLKPLL_LEN)-1)<<CLKRST_TEN_CLKPLL_POS)
#define CLKRST_TEN_CLKPLL_UMSK                                  (~(((1U<<CLKRST_TEN_CLKPLL_LEN)-1)<<CLKRST_TEN_CLKPLL_POS))
#define CLKRST_TEN_CLKPLL2                                      CLKRST_TEN_CLKPLL2
#define CLKRST_TEN_CLKPLL2_POS                                  (8U)
#define CLKRST_TEN_CLKPLL2_LEN                                  (3U)
#define CLKRST_TEN_CLKPLL2_MSK                                  (((1U<<CLKRST_TEN_CLKPLL2_LEN)-1)<<CLKRST_TEN_CLKPLL2_POS)
#define CLKRST_TEN_CLKPLL2_UMSK                                 (~(((1U<<CLKRST_TEN_CLKPLL2_LEN)-1)<<CLKRST_TEN_CLKPLL2_POS))
#define CLKRST_DTEST_CLKIP_EN                                   CLKRST_DTEST_CLKIP_EN
#define CLKRST_DTEST_CLKIP_EN_POS                               (12U)
#define CLKRST_DTEST_CLKIP_EN_LEN                               (2U)
#define CLKRST_DTEST_CLKIP_EN_MSK                               (((1U<<CLKRST_DTEST_CLKIP_EN_LEN)-1)<<CLKRST_DTEST_CLKIP_EN_POS)
#define CLKRST_DTEST_CLKIP_EN_UMSK                              (~(((1U<<CLKRST_DTEST_CLKIP_EN_LEN)-1)<<CLKRST_DTEST_CLKIP_EN_POS))
#define CLKRST_DTEST_CLK25M_EN                                  CLKRST_DTEST_CLK25M_EN
#define CLKRST_DTEST_CLK25M_EN_POS                              (14U)
#define CLKRST_DTEST_CLK25M_EN_LEN                              (1U)
#define CLKRST_DTEST_CLK25M_EN_MSK                              (((1U<<CLKRST_DTEST_CLK25M_EN_LEN)-1)<<CLKRST_DTEST_CLK25M_EN_POS)
#define CLKRST_DTEST_CLK25M_EN_UMSK                             (~(((1U<<CLKRST_DTEST_CLK25M_EN_LEN)-1)<<CLKRST_DTEST_CLK25M_EN_POS))
#define CLKRST_DTEST_PULLDOWN                                   CLKRST_DTEST_PULLDOWN
#define CLKRST_DTEST_PULLDOWN_POS                               (15U)
#define CLKRST_DTEST_PULLDOWN_LEN                               (1U)
#define CLKRST_DTEST_PULLDOWN_MSK                               (((1U<<CLKRST_DTEST_PULLDOWN_LEN)-1)<<CLKRST_DTEST_PULLDOWN_POS)
#define CLKRST_DTEST_PULLDOWN_UMSK                              (~(((1U<<CLKRST_DTEST_PULLDOWN_LEN)-1)<<CLKRST_DTEST_PULLDOWN_POS))

