bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/clkrst_reg.h
/* 0x104 : clkpll register 2 */
#define CLKRST_CLKIP2_OFFSET                                    (0x104)
#define CLKRST_CLKPLL_PU_VCON_CMP                               CLKRST_CLKPLL_PU_VCON_CMP
#define CLKRST_CLKPLL_PU_VCON_CMP_POS                           (0U)
#define CLKRST_CLKPLL_PU_VCON_CMP_LEN                           (1U)
#define CLKRST_CLKPLL_PU_VCON_CMP_MSK                           (((1U<<CLKRST_CLKPLL_PU_VCON_CMP_LEN)-1)<<CLKRST_CLKPLL_PU_VCON_CMP_POS)
#define CLKRST_CLKPLL_PU_VCON_CMP_UMSK                          (~(((1U<<CLKRST_CLKPLL_PU_VCON_CMP_LEN)-1)<<CLKRST_CLKPLL_PU_VCON_CMP_POS))
#define CLKRST_CLKPLL_PU_PFD                                    CLKRST_CLKPLL_PU_PFD
#define CLKRST_CLKPLL_PU_PFD_POS                                (1U)
#define CLKRST_CLKPLL_PU_PFD_LEN                                (1U)
#define CLKRST_CLKPLL_PU_PFD_MSK                                (((1U<<CLKRST_CLKPLL_PU_PFD_LEN)-1)<<CLKRST_CLKPLL_PU_PFD_POS)
#define CLKRST_CLKPLL_PU_PFD_UMSK                               (~(((1U<<CLKRST_CLKPLL_PU_PFD_LEN)-1)<<CLKRST_CLKPLL_PU_PFD_POS))
#define CLKRST_CLKPLL_PU_CP                                     CLKRST_CLKPLL_PU_CP
#define CLKRST_CLKPLL_PU_CP_POS                                 (2U)
#define CLKRST_CLKPLL_PU_CP_LEN                                 (1U)
#define CLKRST_CLKPLL_PU_CP_MSK                                 (((1U<<CLKRST_CLKPLL_PU_CP_LEN)-1)<<CLKRST_CLKPLL_PU_CP_POS)
#define CLKRST_CLKPLL_PU_CP_UMSK                                (~(((1U<<CLKRST_CLKPLL_PU_CP_LEN)-1)<<CLKRST_CLKPLL_PU_CP_POS))
#define CLKRST_CLKPLL_VCON_FORCE_EN                             CLKRST_CLKPLL_VCON_FORCE_EN
#define CLKRST_CLKPLL_VCON_FORCE_EN_POS                         (3U)
#define CLKRST_CLKPLL_VCON_FORCE_EN_LEN                         (1U)
#define CLKRST_CLKPLL_VCON_FORCE_EN_MSK                         (((1U<<CLKRST_CLKPLL_VCON_FORCE_EN_LEN)-1)<<CLKRST_CLKPLL_VCON_FORCE_EN_POS)
#define CLKRST_CLKPLL_VCON_FORCE_EN_UMSK                        (~(((1U<<CLKRST_CLKPLL_VCON_FORCE_EN_LEN)-1)<<CLKRST_CLKPLL_VCON_FORCE_EN_POS))
#define CLKRST_CLKPLL_CP3_SCALE                                 CLKRST_CLKPLL_CP3_SCALE
#define CLKRST_CLKPLL_CP3_SCALE_POS                             (4U)
#define CLKRST_CLKPLL_CP3_SCALE_LEN                             (2U)
#define CLKRST_CLKPLL_CP3_SCALE_MSK                             (((1U<<CLKRST_CLKPLL_CP3_SCALE_LEN)-1)<<CLKRST_CLKPLL_CP3_SCALE_POS)
#define CLKRST_CLKPLL_CP3_SCALE_UMSK                            (~(((1U<<CLKRST_CLKPLL_CP3_SCALE_LEN)-1)<<CLKRST_CLKPLL_CP3_SCALE_POS))
#define CLKRST_CLKPLL_RES_SCALE                                 CLKRST_CLKPLL_RES_SCALE
#define CLKRST_CLKPLL_RES_SCALE_POS                             (6U)
#define CLKRST_CLKPLL_RES_SCALE_LEN                             (3U)
#define CLKRST_CLKPLL_RES_SCALE_MSK                             (((1U<<CLKRST_CLKPLL_RES_SCALE_LEN)-1)<<CLKRST_CLKPLL_RES_SCALE_POS)
#define CLKRST_CLKPLL_RES_SCALE_UMSK                            (~(((1U<<CLKRST_CLKPLL_RES_SCALE_LEN)-1)<<CLKRST_CLKPLL_RES_SCALE_POS))
#define CLKRST_CLKPLL_REFDIV_RATIO                              CLKRST_CLKPLL_REFDIV_RATIO
#define CLKRST_CLKPLL_REFDIV_RATIO_POS                          (9U)
#define CLKRST_CLKPLL_REFDIV_RATIO_LEN                          (4U)
#define CLKRST_CLKPLL_REFDIV_RATIO_MSK                          (((1U<<CLKRST_CLKPLL_REFDIV_RATIO_LEN)-1)<<CLKRST_CLKPLL_REFDIV_RATIO_POS)
#define CLKRST_CLKPLL_REFDIV_RATIO_UMSK                         (~(((1U<<CLKRST_CLKPLL_REFDIV_RATIO_LEN)-1)<<CLKRST_CLKPLL_REFDIV_RATIO_POS))
#define CLKRST_CLKPLL_FBDIV_RATIO                               CLKRST_CLKPLL_FBDIV_RATIO
#define CLKRST_CLKPLL_FBDIV_RATIO_POS                           (13U)
#define CLKRST_CLKPLL_FBDIV_RATIO_LEN                           (10U)
#define CLKRST_CLKPLL_FBDIV_RATIO_MSK                           (((1U<<CLKRST_CLKPLL_FBDIV_RATIO_LEN)-1)<<CLKRST_CLKPLL_FBDIV_RATIO_POS)
#define CLKRST_CLKPLL_FBDIV_RATIO_UMSK                          (~(((1U<<CLKRST_CLKPLL_FBDIV_RATIO_LEN)-1)<<CLKRST_CLKPLL_FBDIV_RATIO_POS))
#define CLKRST_CLKPLL_ICP                                       CLKRST_CLKPLL_ICP
#define CLKRST_CLKPLL_ICP_POS                                   (23U)
#define CLKRST_CLKPLL_ICP_LEN                                   (3U)
#define CLKRST_CLKPLL_ICP_MSK                                   (((1U<<CLKRST_CLKPLL_ICP_LEN)-1)<<CLKRST_CLKPLL_ICP_POS)
#define CLKRST_CLKPLL_ICP_UMSK                                  (~(((1U<<CLKRST_CLKPLL_ICP_LEN)-1)<<CLKRST_CLKPLL_ICP_POS))
#define CLKRST_CLKPLL_SHRTR                                     CLKRST_CLKPLL_SHRTR
#define CLKRST_CLKPLL_SHRTR_POS                                 (26U)
#define CLKRST_CLKPLL_SHRTR_LEN                                 (1U)
#define CLKRST_CLKPLL_SHRTR_MSK                                 (((1U<<CLKRST_CLKPLL_SHRTR_LEN)-1)<<CLKRST_CLKPLL_SHRTR_POS)
#define CLKRST_CLKPLL_SHRTR_UMSK                                (~(((1U<<CLKRST_CLKPLL_SHRTR_LEN)-1)<<CLKRST_CLKPLL_SHRTR_POS))
#define CLKRST_CLKPLL_RINGCAP_EN                                CLKRST_CLKPLL_RINGCAP_EN
#define CLKRST_CLKPLL_RINGCAP_EN_POS                            (27U)
#define CLKRST_CLKPLL_RINGCAP_EN_LEN                            (1U)
#define CLKRST_CLKPLL_RINGCAP_EN_MSK                            (((1U<<CLKRST_CLKPLL_RINGCAP_EN_LEN)-1)<<CLKRST_CLKPLL_RINGCAP_EN_POS)
#define CLKRST_CLKPLL_RINGCAP_EN_UMSK                           (~(((1U<<CLKRST_CLKPLL_RINGCAP_EN_LEN)-1)<<CLKRST_CLKPLL_RINGCAP_EN_POS))
#define CLKRST_CLKPLL_RESET                                     CLKRST_CLKPLL_RESET
#define CLKRST_CLKPLL_RESET_POS                                 (28U)
#define CLKRST_CLKPLL_RESET_LEN                                 (1U)
#define CLKRST_CLKPLL_RESET_MSK                                 (((1U<<CLKRST_CLKPLL_RESET_LEN)-1)<<CLKRST_CLKPLL_RESET_POS)
#define CLKRST_CLKPLL_RESET_UMSK                                (~(((1U<<CLKRST_CLKPLL_RESET_LEN)-1)<<CLKRST_CLKPLL_RESET_POS))

