bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/clkrst_reg.h
/* 0x108 : clkpll register 3 */
#define CLKRST_CLKIP3_OFFSET                                    (0x108)
#define CLKRST_CLKPLL_VCTRL_CMP                                 CLKRST_CLKPLL_VCTRL_CMP
#define CLKRST_CLKPLL_VCTRL_CMP_POS                             (0U)
#define CLKRST_CLKPLL_VCTRL_CMP_LEN                             (2U)
#define CLKRST_CLKPLL_VCTRL_CMP_MSK                             (((1U<<CLKRST_CLKPLL_VCTRL_CMP_LEN)-1)<<CLKRST_CLKPLL_VCTRL_CMP_POS)
#define CLKRST_CLKPLL_VCTRL_CMP_UMSK                            (~(((1U<<CLKRST_CLKPLL_VCTRL_CMP_LEN)-1)<<CLKRST_CLKPLL_VCTRL_CMP_POS))
#define CLKRST_CLKPLL_VCTRL_RANGE                               CLKRST_CLKPLL_VCTRL_RANGE
#define CLKRST_CLKPLL_VCTRL_RANGE_POS                           (2U)
#define CLKRST_CLKPLL_VCTRL_RANGE_LEN                           (2U)
#define CLKRST_CLKPLL_VCTRL_RANGE_MSK                           (((1U<<CLKRST_CLKPLL_VCTRL_RANGE_LEN)-1)<<CLKRST_CLKPLL_VCTRL_RANGE_POS)
#define CLKRST_CLKPLL_VCTRL_RANGE_UMSK                          (~(((1U<<CLKRST_CLKPLL_VCTRL_RANGE_LEN)-1)<<CLKRST_CLKPLL_VCTRL_RANGE_POS))
#define CLKRST_CLKPLL_V2I_R_CAL                                 CLKRST_CLKPLL_V2I_R_CAL
#define CLKRST_CLKPLL_V2I_R_CAL_POS                             (4U)
#define CLKRST_CLKPLL_V2I_R_CAL_LEN                             (4U)
#define CLKRST_CLKPLL_V2I_R_CAL_MSK                             (((1U<<CLKRST_CLKPLL_V2I_R_CAL_LEN)-1)<<CLKRST_CLKPLL_V2I_R_CAL_POS)
#define CLKRST_CLKPLL_V2I_R_CAL_UMSK                            (~(((1U<<CLKRST_CLKPLL_V2I_R_CAL_LEN)-1)<<CLKRST_CLKPLL_V2I_R_CAL_POS))
#define CLKRST_CLKPLL_V2I_IDAC                                  CLKRST_CLKPLL_V2I_IDAC
#define CLKRST_CLKPLL_V2I_IDAC_POS                              (8U)
#define CLKRST_CLKPLL_V2I_IDAC_LEN                              (4U)
#define CLKRST_CLKPLL_V2I_IDAC_MSK                              (((1U<<CLKRST_CLKPLL_V2I_IDAC_LEN)-1)<<CLKRST_CLKPLL_V2I_IDAC_POS)
#define CLKRST_CLKPLL_V2I_IDAC_UMSK                             (~(((1U<<CLKRST_CLKPLL_V2I_IDAC_LEN)-1)<<CLKRST_CLKPLL_V2I_IDAC_POS))
#define CLKRST_CLKPLL_CP_OPAMP_EN                               CLKRST_CLKPLL_CP_OPAMP_EN
#define CLKRST_CLKPLL_CP_OPAMP_EN_POS                           (12U)
#define CLKRST_CLKPLL_CP_OPAMP_EN_LEN                           (1U)
#define CLKRST_CLKPLL_CP_OPAMP_EN_MSK                           (((1U<<CLKRST_CLKPLL_CP_OPAMP_EN_LEN)-1)<<CLKRST_CLKPLL_CP_OPAMP_EN_POS)
#define CLKRST_CLKPLL_CP_OPAMP_EN_UMSK                          (~(((1U<<CLKRST_CLKPLL_CP_OPAMP_EN_LEN)-1)<<CLKRST_CLKPLL_CP_OPAMP_EN_POS))

/* 0x10C : clkpll register 4 */
#define CLKRST_CLKIP4_OFFSET                                    (0x10C)
#define CLKRST_CLKPLL2_PU_VCON_CMP                              CLKRST_CLKPLL2_PU_VCON_CMP
#define CLKRST_CLKPLL2_PU_VCON_CMP_POS                          (0U)
#define CLKRST_CLKPLL2_PU_VCON_CMP_LEN                          (1U)
#define CLKRST_CLKPLL2_PU_VCON_CMP_MSK                          (((1U<<CLKRST_CLKPLL2_PU_VCON_CMP_LEN)-1)<<CLKRST_CLKPLL2_PU_VCON_CMP_POS)
#define CLKRST_CLKPLL2_PU_VCON_CMP_UMSK                         (~(((1U<<CLKRST_CLKPLL2_PU_VCON_CMP_LEN)-1)<<CLKRST_CLKPLL2_PU_VCON_CMP_POS))
#define CLKRST_CLKPLL2_PU_PFD                                   CLKRST_CLKPLL2_PU_PFD
#define CLKRST_CLKPLL2_PU_PFD_POS                               (1U)
#define CLKRST_CLKPLL2_PU_PFD_LEN                               (1U)
#define CLKRST_CLKPLL2_PU_PFD_MSK                               (((1U<<CLKRST_CLKPLL2_PU_PFD_LEN)-1)<<CLKRST_CLKPLL2_PU_PFD_POS)
#define CLKRST_CLKPLL2_PU_PFD_UMSK                              (~(((1U<<CLKRST_CLKPLL2_PU_PFD_LEN)-1)<<CLKRST_CLKPLL2_PU_PFD_POS))
#define CLKRST_CLKPLL2_PU_CP                                    CLKRST_CLKPLL2_PU_CP
#define CLKRST_CLKPLL2_PU_CP_POS                                (2U)
#define CLKRST_CLKPLL2_PU_CP_LEN                                (1U)
#define CLKRST_CLKPLL2_PU_CP_MSK                                (((1U<<CLKRST_CLKPLL2_PU_CP_LEN)-1)<<CLKRST_CLKPLL2_PU_CP_POS)
#define CLKRST_CLKPLL2_PU_CP_UMSK                               (~(((1U<<CLKRST_CLKPLL2_PU_CP_LEN)-1)<<CLKRST_CLKPLL2_PU_CP_POS))
#define CLKRST_CLKPLL2_VCON_FORCE_EN                            CLKRST_CLKPLL2_VCON_FORCE_EN
#define CLKRST_CLKPLL2_VCON_FORCE_EN_POS                        (3U)
#define CLKRST_CLKPLL2_VCON_FORCE_EN_LEN                        (1U)
#define CLKRST_CLKPLL2_VCON_FORCE_EN_MSK                        (((1U<<CLKRST_CLKPLL2_VCON_FORCE_EN_LEN)-1)<<CLKRST_CLKPLL2_VCON_FORCE_EN_POS)
#define CLKRST_CLKPLL2_VCON_FORCE_EN_UMSK                       (~(((1U<<CLKRST_CLKPLL2_VCON_FORCE_EN_LEN)-1)<<CLKRST_CLKPLL2_VCON_FORCE_EN_POS))
#define CLKRST_CLKPLL2_CP3_SCALE                                CLKRST_CLKPLL2_CP3_SCALE
#define CLKRST_CLKPLL2_CP3_SCALE_POS                            (4U)
#define CLKRST_CLKPLL2_CP3_SCALE_LEN                            (2U)
#define CLKRST_CLKPLL2_CP3_SCALE_MSK                            (((1U<<CLKRST_CLKPLL2_CP3_SCALE_LEN)-1)<<CLKRST_CLKPLL2_CP3_SCALE_POS)
#define CLKRST_CLKPLL2_CP3_SCALE_UMSK                           (~(((1U<<CLKRST_CLKPLL2_CP3_SCALE_LEN)-1)<<CLKRST_CLKPLL2_CP3_SCALE_POS))
#define CLKRST_CLKPLL2_RES_SCALE                                CLKRST_CLKPLL2_RES_SCALE
#define CLKRST_CLKPLL2_RES_SCALE_POS                            (6U)
#define CLKRST_CLKPLL2_RES_SCALE_LEN                            (3U)
#define CLKRST_CLKPLL2_RES_SCALE_MSK                            (((1U<<CLKRST_CLKPLL2_RES_SCALE_LEN)-1)<<CLKRST_CLKPLL2_RES_SCALE_POS)
#define CLKRST_CLKPLL2_RES_SCALE_UMSK                           (~(((1U<<CLKRST_CLKPLL2_RES_SCALE_LEN)-1)<<CLKRST_CLKPLL2_RES_SCALE_POS))
#define CLKRST_CLKPLL2_REFDIV_RATIO                             CLKRST_CLKPLL2_REFDIV_RATIO
#define CLKRST_CLKPLL2_REFDIV_RATIO_POS                         (9U)
#define CLKRST_CLKPLL2_REFDIV_RATIO_LEN                         (4U)
#define CLKRST_CLKPLL2_REFDIV_RATIO_MSK                         (((1U<<CLKRST_CLKPLL2_REFDIV_RATIO_LEN)-1)<<CLKRST_CLKPLL2_REFDIV_RATIO_POS)
#define CLKRST_CLKPLL2_REFDIV_RATIO_UMSK                        (~(((1U<<CLKRST_CLKPLL2_REFDIV_RATIO_LEN)-1)<<CLKRST_CLKPLL2_REFDIV_RATIO_POS))
#define CLKRST_CLKPLL2_FBDIV_RATIO                              CLKRST_CLKPLL2_FBDIV_RATIO
#define CLKRST_CLKPLL2_FBDIV_RATIO_POS                          (13U)
#define CLKRST_CLKPLL2_FBDIV_RATIO_LEN                          (10U)
#define CLKRST_CLKPLL2_FBDIV_RATIO_MSK                          (((1U<<CLKRST_CLKPLL2_FBDIV_RATIO_LEN)-1)<<CLKRST_CLKPLL2_FBDIV_RATIO_POS)
#define CLKRST_CLKPLL2_FBDIV_RATIO_UMSK                         (~(((1U<<CLKRST_CLKPLL2_FBDIV_RATIO_LEN)-1)<<CLKRST_CLKPLL2_FBDIV_RATIO_POS))
#define CLKRST_CLKPLL2_ICP                                      CLKRST_CLKPLL2_ICP
#define CLKRST_CLKPLL2_ICP_POS                                  (23U)
#define CLKRST_CLKPLL2_ICP_LEN                                  (3U)
#define CLKRST_CLKPLL2_ICP_MSK                                  (((1U<<CLKRST_CLKPLL2_ICP_LEN)-1)<<CLKRST_CLKPLL2_ICP_POS)
#define CLKRST_CLKPLL2_ICP_UMSK                                 (~(((1U<<CLKRST_CLKPLL2_ICP_LEN)-1)<<CLKRST_CLKPLL2_ICP_POS))
#define CLKRST_CLKPLL2_SHRTR                                    CLKRST_CLKPLL2_SHRTR
#define CLKRST_CLKPLL2_SHRTR_POS                                (26U)
#define CLKRST_CLKPLL2_SHRTR_LEN                                (1U)
#define CLKRST_CLKPLL2_SHRTR_MSK                                (((1U<<CLKRST_CLKPLL2_SHRTR_LEN)-1)<<CLKRST_CLKPLL2_SHRTR_POS)
#define CLKRST_CLKPLL2_SHRTR_UMSK                               (~(((1U<<CLKRST_CLKPLL2_SHRTR_LEN)-1)<<CLKRST_CLKPLL2_SHRTR_POS))
#define CLKRST_CLKPLL2_RINGCAP_EN                               CLKRST_CLKPLL2_RINGCAP_EN
#define CLKRST_CLKPLL2_RINGCAP_EN_POS                           (27U)
#define CLKRST_CLKPLL2_RINGCAP_EN_LEN                           (1U)
#define CLKRST_CLKPLL2_RINGCAP_EN_MSK                           (((1U<<CLKRST_CLKPLL2_RINGCAP_EN_LEN)-1)<<CLKRST_CLKPLL2_RINGCAP_EN_POS)
#define CLKRST_CLKPLL2_RINGCAP_EN_UMSK                          (~(((1U<<CLKRST_CLKPLL2_RINGCAP_EN_LEN)-1)<<CLKRST_CLKPLL2_RINGCAP_EN_POS))
#define CLKRST_CLKPLL2_RESET                                    CLKRST_CLKPLL2_RESET
#define CLKRST_CLKPLL2_RESET_POS                                (28U)
#define CLKRST_CLKPLL2_RESET_LEN                                (1U)
#define CLKRST_CLKPLL2_RESET_MSK                                (((1U<<CLKRST_CLKPLL2_RESET_LEN)-1)<<CLKRST_CLKPLL2_RESET_POS)
#define CLKRST_CLKPLL2_RESET_UMSK                               (~(((1U<<CLKRST_CLKPLL2_RESET_LEN)-1)<<CLKRST_CLKPLL2_RESET_POS))

