bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/clkrst_reg.h
/* 0x110 : clkpll register 5 */
#define CLKRST_CLKIP5_OFFSET                                    (0x110)
#define CLKRST_CLKPLL2_VCTRL_CMP                                CLKRST_CLKPLL2_VCTRL_CMP
#define CLKRST_CLKPLL2_VCTRL_CMP_POS                            (0U)
#define CLKRST_CLKPLL2_VCTRL_CMP_LEN                            (2U)
#define CLKRST_CLKPLL2_VCTRL_CMP_MSK                            (((1U<<CLKRST_CLKPLL2_VCTRL_CMP_LEN)-1)<<CLKRST_CLKPLL2_VCTRL_CMP_POS)
#define CLKRST_CLKPLL2_VCTRL_CMP_UMSK                           (~(((1U<<CLKRST_CLKPLL2_VCTRL_CMP_LEN)-1)<<CLKRST_CLKPLL2_VCTRL_CMP_POS))
#define CLKRST_CLKPLL2_VCTRL_RANGE                              CLKRST_CLKPLL2_VCTRL_RANGE
#define CLKRST_CLKPLL2_VCTRL_RANGE_POS                          (4U)
#define CLKRST_CLKPLL2_VCTRL_RANGE_LEN                          (2U)
#define CLKRST_CLKPLL2_VCTRL_RANGE_MSK                          (((1U<<CLKRST_CLKPLL2_VCTRL_RANGE_LEN)-1)<<CLKRST_CLKPLL2_VCTRL_RANGE_POS)
#define CLKRST_CLKPLL2_VCTRL_RANGE_UMSK                         (~(((1U<<CLKRST_CLKPLL2_VCTRL_RANGE_LEN)-1)<<CLKRST_CLKPLL2_VCTRL_RANGE_POS))
#define CLKRST_CLKPLL2_V2I_R_CAL                                CLKRST_CLKPLL2_V2I_R_CAL
#define CLKRST_CLKPLL2_V2I_R_CAL_POS                            (8U)
#define CLKRST_CLKPLL2_V2I_R_CAL_LEN                            (4U)
#define CLKRST_CLKPLL2_V2I_R_CAL_MSK                            (((1U<<CLKRST_CLKPLL2_V2I_R_CAL_LEN)-1)<<CLKRST_CLKPLL2_V2I_R_CAL_POS)
#define CLKRST_CLKPLL2_V2I_R_CAL_UMSK                           (~(((1U<<CLKRST_CLKPLL2_V2I_R_CAL_LEN)-1)<<CLKRST_CLKPLL2_V2I_R_CAL_POS))
#define CLKRST_CLKPLL2_V2I_IDAC                                 CLKRST_CLKPLL2_V2I_IDAC
#define CLKRST_CLKPLL2_V2I_IDAC_POS                             (12U)
#define CLKRST_CLKPLL2_V2I_IDAC_LEN                             (4U)
#define CLKRST_CLKPLL2_V2I_IDAC_MSK                             (((1U<<CLKRST_CLKPLL2_V2I_IDAC_LEN)-1)<<CLKRST_CLKPLL2_V2I_IDAC_POS)
#define CLKRST_CLKPLL2_V2I_IDAC_UMSK                            (~(((1U<<CLKRST_CLKPLL2_V2I_IDAC_LEN)-1)<<CLKRST_CLKPLL2_V2I_IDAC_POS))
#define CLKRST_CLKPLL2_CP_OPAMP_EN                              CLKRST_CLKPLL2_CP_OPAMP_EN
#define CLKRST_CLKPLL2_CP_OPAMP_EN_POS                          (16U)
#define CLKRST_CLKPLL2_CP_OPAMP_EN_LEN                          (1U)
#define CLKRST_CLKPLL2_CP_OPAMP_EN_MSK                          (((1U<<CLKRST_CLKPLL2_CP_OPAMP_EN_LEN)-1)<<CLKRST_CLKPLL2_CP_OPAMP_EN_POS)
#define CLKRST_CLKPLL2_CP_OPAMP_EN_UMSK                         (~(((1U<<CLKRST_CLKPLL2_CP_OPAMP_EN_LEN)-1)<<CLKRST_CLKPLL2_CP_OPAMP_EN_POS))

/* 0x114 : clkip prediv */
#define CLKRST_CLKIP_PREDIV_OFFSET                              (0x114)
#define CLKRST_PREDIV_REF_SEL                                   CLKRST_PREDIV_REF_SEL
#define CLKRST_PREDIV_REF_SEL_POS                               (0U)
#define CLKRST_PREDIV_REF_SEL_LEN                               (3U)
#define CLKRST_PREDIV_REF_SEL_MSK                               (((1U<<CLKRST_PREDIV_REF_SEL_LEN)-1)<<CLKRST_PREDIV_REF_SEL_POS)
#define CLKRST_PREDIV_REF_SEL_UMSK                              (~(((1U<<CLKRST_PREDIV_REF_SEL_LEN)-1)<<CLKRST_PREDIV_REF_SEL_POS))
#define CLKRST_PU_PREDIV                                        CLKRST_PU_PREDIV
#define CLKRST_PU_PREDIV_POS                                    (3U)
#define CLKRST_PU_PREDIV_LEN                                    (1U)
#define CLKRST_PU_PREDIV_MSK                                    (((1U<<CLKRST_PU_PREDIV_LEN)-1)<<CLKRST_PU_PREDIV_POS)
#define CLKRST_PU_PREDIV_UMSK                                   (~(((1U<<CLKRST_PU_PREDIV_LEN)-1)<<CLKRST_PU_PREDIV_POS))
#define CLKRST_PREDIV                                           CLKRST_PREDIV
#define CLKRST_PREDIV_POS                                       (4U)
#define CLKRST_PREDIV_LEN                                       (7U)
#define CLKRST_PREDIV_MSK                                       (((1U<<CLKRST_PREDIV_LEN)-1)<<CLKRST_PREDIV_POS)
#define CLKRST_PREDIV_UMSK                                      (~(((1U<<CLKRST_PREDIV_LEN)-1)<<CLKRST_PREDIV_POS))
#define CLKRST_RESET_PREDIV                                     CLKRST_RESET_PREDIV
#define CLKRST_RESET_PREDIV_POS                                 (11U)
#define CLKRST_RESET_PREDIV_LEN                                 (1U)
#define CLKRST_RESET_PREDIV_MSK                                 (((1U<<CLKRST_RESET_PREDIV_LEN)-1)<<CLKRST_RESET_PREDIV_POS)
#define CLKRST_RESET_PREDIV_UMSK                                (~(((1U<<CLKRST_RESET_PREDIV_LEN)-1)<<CLKRST_RESET_PREDIV_POS))

/* 0x118 : clkip postdiv */
#define CLKRST_CLKIP_POSTDIV_OFFSET                             (0x118)
#define CLKRST_CLKPLL_EN_400M_CLK                               CLKRST_CLKPLL_EN_400M_CLK
#define CLKRST_CLKPLL_EN_400M_CLK_POS                           (1U)
#define CLKRST_CLKPLL_EN_400M_CLK_LEN                           (1U)
#define CLKRST_CLKPLL_EN_400M_CLK_MSK                           (((1U<<CLKRST_CLKPLL_EN_400M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_400M_CLK_POS)
#define CLKRST_CLKPLL_EN_400M_CLK_UMSK                          (~(((1U<<CLKRST_CLKPLL_EN_400M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_400M_CLK_POS))
#define CLKRST_CLKPLL_EN_320M_CLK                               CLKRST_CLKPLL_EN_320M_CLK
#define CLKRST_CLKPLL_EN_320M_CLK_POS                           (2U)
#define CLKRST_CLKPLL_EN_320M_CLK_LEN                           (1U)
#define CLKRST_CLKPLL_EN_320M_CLK_MSK                           (((1U<<CLKRST_CLKPLL_EN_320M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_320M_CLK_POS)
#define CLKRST_CLKPLL_EN_320M_CLK_UMSK                          (~(((1U<<CLKRST_CLKPLL_EN_320M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_320M_CLK_POS))
#define CLKRST_CLKPLL_EN_267M_CLK                               CLKRST_CLKPLL_EN_267M_CLK
#define CLKRST_CLKPLL_EN_267M_CLK_POS                           (3U)
#define CLKRST_CLKPLL_EN_267M_CLK_LEN                           (1U)
#define CLKRST_CLKPLL_EN_267M_CLK_MSK                           (((1U<<CLKRST_CLKPLL_EN_267M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_267M_CLK_POS)
#define CLKRST_CLKPLL_EN_267M_CLK_UMSK                          (~(((1U<<CLKRST_CLKPLL_EN_267M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_267M_CLK_POS))
#define CLKRST_CLKPLL_EN_240M_CLK                               CLKRST_CLKPLL_EN_240M_CLK
#define CLKRST_CLKPLL_EN_240M_CLK_POS                           (4U)
#define CLKRST_CLKPLL_EN_240M_CLK_LEN                           (1U)
#define CLKRST_CLKPLL_EN_240M_CLK_MSK                           (((1U<<CLKRST_CLKPLL_EN_240M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_240M_CLK_POS)
#define CLKRST_CLKPLL_EN_240M_CLK_UMSK                          (~(((1U<<CLKRST_CLKPLL_EN_240M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_240M_CLK_POS))
#define CLKRST_CLKPLL_EN_192M_CLK                               CLKRST_CLKPLL_EN_192M_CLK
#define CLKRST_CLKPLL_EN_192M_CLK_POS                           (5U)
#define CLKRST_CLKPLL_EN_192M_CLK_LEN                           (1U)
#define CLKRST_CLKPLL_EN_192M_CLK_MSK                           (((1U<<CLKRST_CLKPLL_EN_192M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_192M_CLK_POS)
#define CLKRST_CLKPLL_EN_192M_CLK_UMSK                          (~(((1U<<CLKRST_CLKPLL_EN_192M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_192M_CLK_POS))
#define CLKRST_CLKPLL_EN_160M_CLK                               CLKRST_CLKPLL_EN_160M_CLK
#define CLKRST_CLKPLL_EN_160M_CLK_POS                           (6U)
#define CLKRST_CLKPLL_EN_160M_CLK_LEN                           (1U)
#define CLKRST_CLKPLL_EN_160M_CLK_MSK                           (((1U<<CLKRST_CLKPLL_EN_160M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_160M_CLK_POS)
#define CLKRST_CLKPLL_EN_160M_CLK_UMSK                          (~(((1U<<CLKRST_CLKPLL_EN_160M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_160M_CLK_POS))
#define CLKRST_CLKPLL_EN_120M_CLK                               CLKRST_CLKPLL_EN_120M_CLK
#define CLKRST_CLKPLL_EN_120M_CLK_POS                           (7U)
#define CLKRST_CLKPLL_EN_120M_CLK_LEN                           (1U)
#define CLKRST_CLKPLL_EN_120M_CLK_MSK                           (((1U<<CLKRST_CLKPLL_EN_120M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_120M_CLK_POS)
#define CLKRST_CLKPLL_EN_120M_CLK_UMSK                          (~(((1U<<CLKRST_CLKPLL_EN_120M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_120M_CLK_POS))
#define CLKRST_CLKPLL_EN_100M_CLK                               CLKRST_CLKPLL_EN_100M_CLK
#define CLKRST_CLKPLL_EN_100M_CLK_POS                           (8U)
#define CLKRST_CLKPLL_EN_100M_CLK_LEN                           (1U)
#define CLKRST_CLKPLL_EN_100M_CLK_MSK                           (((1U<<CLKRST_CLKPLL_EN_100M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_100M_CLK_POS)
#define CLKRST_CLKPLL_EN_100M_CLK_UMSK                          (~(((1U<<CLKRST_CLKPLL_EN_100M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_100M_CLK_POS))
#define CLKRST_CLKPLL_EN_50M_CLK                                CLKRST_CLKPLL_EN_50M_CLK
#define CLKRST_CLKPLL_EN_50M_CLK_POS                            (9U)
#define CLKRST_CLKPLL_EN_50M_CLK_LEN                            (1U)
#define CLKRST_CLKPLL_EN_50M_CLK_MSK                            (((1U<<CLKRST_CLKPLL_EN_50M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_50M_CLK_POS)
#define CLKRST_CLKPLL_EN_50M_CLK_UMSK                           (~(((1U<<CLKRST_CLKPLL_EN_50M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_50M_CLK_POS))
#define CLKRST_CLKPLL_EN_25M_CLK                                CLKRST_CLKPLL_EN_25M_CLK
#define CLKRST_CLKPLL_EN_25M_CLK_POS                            (10U)
#define CLKRST_CLKPLL_EN_25M_CLK_LEN                            (1U)
#define CLKRST_CLKPLL_EN_25M_CLK_MSK                            (((1U<<CLKRST_CLKPLL_EN_25M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_25M_CLK_POS)
#define CLKRST_CLKPLL_EN_25M_CLK_UMSK                           (~(((1U<<CLKRST_CLKPLL_EN_25M_CLK_LEN)-1)<<CLKRST_CLKPLL_EN_25M_CLK_POS))
#define CLKRST_PLL_CLK_SEL                                      CLKRST_PLL_CLK_SEL
#define CLKRST_PLL_CLK_SEL_POS                                  (12U)
#define CLKRST_PLL_CLK_SEL_LEN                                  (2U)
#define CLKRST_PLL_CLK_SEL_MSK                                  (((1U<<CLKRST_PLL_CLK_SEL_LEN)-1)<<CLKRST_PLL_CLK_SEL_POS)
#define CLKRST_PLL_CLK_SEL_UMSK                                 (~(((1U<<CLKRST_PLL_CLK_SEL_LEN)-1)<<CLKRST_PLL_CLK_SEL_POS))
#define CLKRST_PU_POSTDIV                                       CLKRST_PU_POSTDIV
#define CLKRST_PU_POSTDIV_POS                                   (14U)
#define CLKRST_PU_POSTDIV_LEN                                   (1U)
#define CLKRST_PU_POSTDIV_MSK                                   (((1U<<CLKRST_PU_POSTDIV_LEN)-1)<<CLKRST_PU_POSTDIV_POS)
#define CLKRST_PU_POSTDIV_UMSK                                  (~(((1U<<CLKRST_PU_POSTDIV_LEN)-1)<<CLKRST_PU_POSTDIV_POS))

