bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/clkrst_reg.h
/* 0x11C : clkip aupll register 1 */
#define CLKRST_CLKIP_AUPLL1_OFFSET                              (0x11C)
#define CLKRST_AUPLL_VCO_SPEED                                  CLKRST_AUPLL_VCO_SPEED
#define CLKRST_AUPLL_VCO_SPEED_POS                              (0U)
#define CLKRST_AUPLL_VCO_SPEED_LEN                              (3U)
#define CLKRST_AUPLL_VCO_SPEED_MSK                              (((1U<<CLKRST_AUPLL_VCO_SPEED_LEN)-1)<<CLKRST_AUPLL_VCO_SPEED_POS)
#define CLKRST_AUPLL_VCO_SPEED_UMSK                             (~(((1U<<CLKRST_AUPLL_VCO_SPEED_LEN)-1)<<CLKRST_AUPLL_VCO_SPEED_POS))
#define CLKRST_AUPLL_ICP                                        CLKRST_AUPLL_ICP
#define CLKRST_AUPLL_ICP_POS                                    (3U)
#define CLKRST_AUPLL_ICP_LEN                                    (3U)
#define CLKRST_AUPLL_ICP_MSK                                    (((1U<<CLKRST_AUPLL_ICP_LEN)-1)<<CLKRST_AUPLL_ICP_POS)
#define CLKRST_AUPLL_ICP_UMSK                                   (~(((1U<<CLKRST_AUPLL_ICP_LEN)-1)<<CLKRST_AUPLL_ICP_POS))
#define CLKRST_AUPLL_R4_SHORT                                   CLKRST_AUPLL_R4_SHORT
#define CLKRST_AUPLL_R4_SHORT_POS                               (6U)
#define CLKRST_AUPLL_R4_SHORT_LEN                               (1U)
#define CLKRST_AUPLL_R4_SHORT_MSK                               (((1U<<CLKRST_AUPLL_R4_SHORT_LEN)-1)<<CLKRST_AUPLL_R4_SHORT_POS)
#define CLKRST_AUPLL_R4_SHORT_UMSK                              (~(((1U<<CLKRST_AUPLL_R4_SHORT_LEN)-1)<<CLKRST_AUPLL_R4_SHORT_POS))
#define CLKRST_AUPLL_R4                                         CLKRST_AUPLL_R4
#define CLKRST_AUPLL_R4_POS                                     (7U)
#define CLKRST_AUPLL_R4_LEN                                     (2U)
#define CLKRST_AUPLL_R4_MSK                                     (((1U<<CLKRST_AUPLL_R4_LEN)-1)<<CLKRST_AUPLL_R4_POS)
#define CLKRST_AUPLL_R4_UMSK                                    (~(((1U<<CLKRST_AUPLL_R4_LEN)-1)<<CLKRST_AUPLL_R4_POS))
#define CLKRST_AUPLL_C3                                         CLKRST_AUPLL_C3
#define CLKRST_AUPLL_C3_POS                                     (9U)
#define CLKRST_AUPLL_C3_LEN                                     (2U)
#define CLKRST_AUPLL_C3_MSK                                     (((1U<<CLKRST_AUPLL_C3_LEN)-1)<<CLKRST_AUPLL_C3_POS)
#define CLKRST_AUPLL_C3_UMSK                                    (~(((1U<<CLKRST_AUPLL_C3_LEN)-1)<<CLKRST_AUPLL_C3_POS))
#define CLKRST_AUPLL_CZ                                         CLKRST_AUPLL_CZ
#define CLKRST_AUPLL_CZ_POS                                     (11U)
#define CLKRST_AUPLL_CZ_LEN                                     (2U)
#define CLKRST_AUPLL_CZ_MSK                                     (((1U<<CLKRST_AUPLL_CZ_LEN)-1)<<CLKRST_AUPLL_CZ_POS)
#define CLKRST_AUPLL_CZ_UMSK                                    (~(((1U<<CLKRST_AUPLL_CZ_LEN)-1)<<CLKRST_AUPLL_CZ_POS))
#define CLKRST_AUPLL_RZ                                         CLKRST_AUPLL_RZ
#define CLKRST_AUPLL_RZ_POS                                     (13U)
#define CLKRST_AUPLL_RZ_LEN                                     (2U)
#define CLKRST_AUPLL_RZ_MSK                                     (((1U<<CLKRST_AUPLL_RZ_LEN)-1)<<CLKRST_AUPLL_RZ_POS)
#define CLKRST_AUPLL_RZ_UMSK                                    (~(((1U<<CLKRST_AUPLL_RZ_LEN)-1)<<CLKRST_AUPLL_RZ_POS))
#define CLKRST_AUPLL_REFDIV_RATIO                               CLKRST_AUPLL_REFDIV_RATIO
#define CLKRST_AUPLL_REFDIV_RATIO_POS                           (21U)
#define CLKRST_AUPLL_REFDIV_RATIO_LEN                           (4U)
#define CLKRST_AUPLL_REFDIV_RATIO_MSK                           (((1U<<CLKRST_AUPLL_REFDIV_RATIO_LEN)-1)<<CLKRST_AUPLL_REFDIV_RATIO_POS)
#define CLKRST_AUPLL_REFDIV_RATIO_UMSK                          (~(((1U<<CLKRST_AUPLL_REFDIV_RATIO_LEN)-1)<<CLKRST_AUPLL_REFDIV_RATIO_POS))
#define CLKRST_AUPLL_RESET_REFDIV                               CLKRST_AUPLL_RESET_REFDIV
#define CLKRST_AUPLL_RESET_REFDIV_POS                           (25U)
#define CLKRST_AUPLL_RESET_REFDIV_LEN                           (1U)
#define CLKRST_AUPLL_RESET_REFDIV_MSK                           (((1U<<CLKRST_AUPLL_RESET_REFDIV_LEN)-1)<<CLKRST_AUPLL_RESET_REFDIV_POS)
#define CLKRST_AUPLL_RESET_REFDIV_UMSK                          (~(((1U<<CLKRST_AUPLL_RESET_REFDIV_LEN)-1)<<CLKRST_AUPLL_RESET_REFDIV_POS))
#define CLKRST_AUPLL_SHRTR                                      CLKRST_AUPLL_SHRTR
#define CLKRST_AUPLL_SHRTR_POS                                  (26U)
#define CLKRST_AUPLL_SHRTR_LEN                                  (1U)
#define CLKRST_AUPLL_SHRTR_MSK                                  (((1U<<CLKRST_AUPLL_SHRTR_LEN)-1)<<CLKRST_AUPLL_SHRTR_POS)
#define CLKRST_AUPLL_SHRTR_UMSK                                 (~(((1U<<CLKRST_AUPLL_SHRTR_LEN)-1)<<CLKRST_AUPLL_SHRTR_POS))
#define CLKRST_AUPLL_PU_PFD                                     CLKRST_AUPLL_PU_PFD
#define CLKRST_AUPLL_PU_PFD_POS                                 (27U)
#define CLKRST_AUPLL_PU_PFD_LEN                                 (1U)
#define CLKRST_AUPLL_PU_PFD_MSK                                 (((1U<<CLKRST_AUPLL_PU_PFD_LEN)-1)<<CLKRST_AUPLL_PU_PFD_POS)
#define CLKRST_AUPLL_PU_PFD_UMSK                                (~(((1U<<CLKRST_AUPLL_PU_PFD_LEN)-1)<<CLKRST_AUPLL_PU_PFD_POS))
#define CLKRST_AUPLL_RESET_FBDV                                 CLKRST_AUPLL_RESET_FBDV
#define CLKRST_AUPLL_RESET_FBDV_POS                             (28U)
#define CLKRST_AUPLL_RESET_FBDV_LEN                             (1U)
#define CLKRST_AUPLL_RESET_FBDV_MSK                             (((1U<<CLKRST_AUPLL_RESET_FBDV_LEN)-1)<<CLKRST_AUPLL_RESET_FBDV_POS)
#define CLKRST_AUPLL_RESET_FBDV_UMSK                            (~(((1U<<CLKRST_AUPLL_RESET_FBDV_LEN)-1)<<CLKRST_AUPLL_RESET_FBDV_POS))
#define CLKRST_AUPLL_PU_FBDV                                    CLKRST_AUPLL_PU_FBDV
#define CLKRST_AUPLL_PU_FBDV_POS                                (29U)
#define CLKRST_AUPLL_PU_FBDV_LEN                                (1U)
#define CLKRST_AUPLL_PU_FBDV_MSK                                (((1U<<CLKRST_AUPLL_PU_FBDV_LEN)-1)<<CLKRST_AUPLL_PU_FBDV_POS)
#define CLKRST_AUPLL_PU_FBDV_UMSK                               (~(((1U<<CLKRST_AUPLL_PU_FBDV_LEN)-1)<<CLKRST_AUPLL_PU_FBDV_POS))
#define CLKRST_AUPLL_CP_OPAMP_EN                                CLKRST_AUPLL_CP_OPAMP_EN
#define CLKRST_AUPLL_CP_OPAMP_EN_POS                            (30U)
#define CLKRST_AUPLL_CP_OPAMP_EN_LEN                            (1U)
#define CLKRST_AUPLL_CP_OPAMP_EN_MSK                            (((1U<<CLKRST_AUPLL_CP_OPAMP_EN_LEN)-1)<<CLKRST_AUPLL_CP_OPAMP_EN_POS)
#define CLKRST_AUPLL_CP_OPAMP_EN_UMSK                           (~(((1U<<CLKRST_AUPLL_CP_OPAMP_EN_LEN)-1)<<CLKRST_AUPLL_CP_OPAMP_EN_POS))
#define CLKRST_AUPLL_PU_CP                                      CLKRST_AUPLL_PU_CP
#define CLKRST_AUPLL_PU_CP_POS                                  (31U)
#define CLKRST_AUPLL_PU_CP_LEN                                  (1U)
#define CLKRST_AUPLL_PU_CP_MSK                                  (((1U<<CLKRST_AUPLL_PU_CP_LEN)-1)<<CLKRST_AUPLL_PU_CP_POS)
#define CLKRST_AUPLL_PU_CP_UMSK                                 (~(((1U<<CLKRST_AUPLL_PU_CP_LEN)-1)<<CLKRST_AUPLL_PU_CP_POS))

/* 0x120 : clkip aupll register 2 */
#define CLKRST_CLKIP_AUPLL2_OFFSET                              (0x120)
#define CLKRST_AUPLL_SDMIN                                      CLKRST_AUPLL_SDMIN
#define CLKRST_AUPLL_SDMIN_POS                                  (0U)
#define CLKRST_AUPLL_SDMIN_LEN                                  (24U)
#define CLKRST_AUPLL_SDMIN_MSK                                  (((1U<<CLKRST_AUPLL_SDMIN_LEN)-1)<<CLKRST_AUPLL_SDMIN_POS)
#define CLKRST_AUPLL_SDMIN_UMSK                                 (~(((1U<<CLKRST_AUPLL_SDMIN_LEN)-1)<<CLKRST_AUPLL_SDMIN_POS))

/* 0x124 : clkip aupll register 3 */
#define CLKRST_CLKIP_AUPLL3_OFFSET                              (0x124)
#define CLKRST_AUPLL_PU                                         CLKRST_AUPLL_PU
#define CLKRST_AUPLL_PU_POS                                     (0U)
#define CLKRST_AUPLL_PU_LEN                                     (1U)
#define CLKRST_AUPLL_PU_MSK                                     (((1U<<CLKRST_AUPLL_PU_LEN)-1)<<CLKRST_AUPLL_PU_POS)
#define CLKRST_AUPLL_PU_UMSK                                    (~(((1U<<CLKRST_AUPLL_PU_LEN)-1)<<CLKRST_AUPLL_PU_POS))
#define CLKRST_TEN_AUPLL                                        CLKRST_TEN_AUPLL
#define CLKRST_TEN_AUPLL_POS                                    (2U)
#define CLKRST_TEN_AUPLL_LEN                                    (2U)
#define CLKRST_TEN_AUPLL_MSK                                    (((1U<<CLKRST_TEN_AUPLL_LEN)-1)<<CLKRST_TEN_AUPLL_POS)
#define CLKRST_TEN_AUPLL_UMSK                                   (~(((1U<<CLKRST_TEN_AUPLL_LEN)-1)<<CLKRST_TEN_AUPLL_POS))
#define CLKRST_DTEST_AUPLL_FSDM_EN                              CLKRST_DTEST_AUPLL_FSDM_EN
#define CLKRST_DTEST_AUPLL_FSDM_EN_POS                          (4U)
#define CLKRST_DTEST_AUPLL_FSDM_EN_LEN                          (1U)
#define CLKRST_DTEST_AUPLL_FSDM_EN_MSK                          (((1U<<CLKRST_DTEST_AUPLL_FSDM_EN_LEN)-1)<<CLKRST_DTEST_AUPLL_FSDM_EN_POS)
#define CLKRST_DTEST_AUPLL_FSDM_EN_UMSK                         (~(((1U<<CLKRST_DTEST_AUPLL_FSDM_EN_LEN)-1)<<CLKRST_DTEST_AUPLL_FSDM_EN_POS))
#define CLKRST_DTEST_AUPLL_FREF_EN                              CLKRST_DTEST_AUPLL_FREF_EN
#define CLKRST_DTEST_AUPLL_FREF_EN_POS                          (5U)
#define CLKRST_DTEST_AUPLL_FREF_EN_LEN                          (1U)
#define CLKRST_DTEST_AUPLL_FREF_EN_MSK                          (((1U<<CLKRST_DTEST_AUPLL_FREF_EN_LEN)-1)<<CLKRST_DTEST_AUPLL_FREF_EN_POS)
#define CLKRST_DTEST_AUPLL_FREF_EN_UMSK                         (~(((1U<<CLKRST_DTEST_AUPLL_FREF_EN_LEN)-1)<<CLKRST_DTEST_AUPLL_FREF_EN_POS))
#define CLKRST_DTEST_AUPLL_FIN_EN                               CLKRST_DTEST_AUPLL_FIN_EN
#define CLKRST_DTEST_AUPLL_FIN_EN_POS                           (6U)
#define CLKRST_DTEST_AUPLL_FIN_EN_LEN                           (1U)
#define CLKRST_DTEST_AUPLL_FIN_EN_MSK                           (((1U<<CLKRST_DTEST_AUPLL_FIN_EN_LEN)-1)<<CLKRST_DTEST_AUPLL_FIN_EN_POS)
#define CLKRST_DTEST_AUPLL_FIN_EN_UMSK                          (~(((1U<<CLKRST_DTEST_AUPLL_FIN_EN_LEN)-1)<<CLKRST_DTEST_AUPLL_FIN_EN_POS))
#define CLKRST_AUPLL_POSTDIV                                    CLKRST_AUPLL_POSTDIV
#define CLKRST_AUPLL_POSTDIV_POS                                (7U)
#define CLKRST_AUPLL_POSTDIV_LEN                                (7U)
#define CLKRST_AUPLL_POSTDIV_MSK                                (((1U<<CLKRST_AUPLL_POSTDIV_LEN)-1)<<CLKRST_AUPLL_POSTDIV_POS)
#define CLKRST_AUPLL_POSTDIV_UMSK                               (~(((1U<<CLKRST_AUPLL_POSTDIV_LEN)-1)<<CLKRST_AUPLL_POSTDIV_POS))
#define CLKRST_AUPLL_SEL_SAMPLE_CLK                             CLKRST_AUPLL_SEL_SAMPLE_CLK
#define CLKRST_AUPLL_SEL_SAMPLE_CLK_POS                         (14U)
#define CLKRST_AUPLL_SEL_SAMPLE_CLK_LEN                         (2U)
#define CLKRST_AUPLL_SEL_SAMPLE_CLK_MSK                         (((1U<<CLKRST_AUPLL_SEL_SAMPLE_CLK_LEN)-1)<<CLKRST_AUPLL_SEL_SAMPLE_CLK_POS)
#define CLKRST_AUPLL_SEL_SAMPLE_CLK_UMSK                        (~(((1U<<CLKRST_AUPLL_SEL_SAMPLE_CLK_LEN)-1)<<CLKRST_AUPLL_SEL_SAMPLE_CLK_POS))
#define CLKRST_AUPLL_RESET_POSTDIV                              CLKRST_AUPLL_RESET_POSTDIV
#define CLKRST_AUPLL_RESET_POSTDIV_POS                          (16U)
#define CLKRST_AUPLL_RESET_POSTDIV_LEN                          (1U)
#define CLKRST_AUPLL_RESET_POSTDIV_MSK                          (((1U<<CLKRST_AUPLL_RESET_POSTDIV_LEN)-1)<<CLKRST_AUPLL_RESET_POSTDIV_POS)
#define CLKRST_AUPLL_RESET_POSTDIV_UMSK                         (~(((1U<<CLKRST_AUPLL_RESET_POSTDIV_LEN)-1)<<CLKRST_AUPLL_RESET_POSTDIV_POS))
#define CLKRST_AUPLL_SEL_FB_CLK                                 CLKRST_AUPLL_SEL_FB_CLK
#define CLKRST_AUPLL_SEL_FB_CLK_POS                             (17U)
#define CLKRST_AUPLL_SEL_FB_CLK_LEN                             (2U)
#define CLKRST_AUPLL_SEL_FB_CLK_MSK                             (((1U<<CLKRST_AUPLL_SEL_FB_CLK_LEN)-1)<<CLKRST_AUPLL_SEL_FB_CLK_POS)
#define CLKRST_AUPLL_SEL_FB_CLK_UMSK                            (~(((1U<<CLKRST_AUPLL_SEL_FB_CLK_LEN)-1)<<CLKRST_AUPLL_SEL_FB_CLK_POS))
#define CLKRST_AUPLL_SDM_RESET                                  CLKRST_AUPLL_SDM_RESET
#define CLKRST_AUPLL_SDM_RESET_POS                              (19U)
#define CLKRST_AUPLL_SDM_RESET_LEN                              (1U)
#define CLKRST_AUPLL_SDM_RESET_MSK                              (((1U<<CLKRST_AUPLL_SDM_RESET_LEN)-1)<<CLKRST_AUPLL_SDM_RESET_POS)
#define CLKRST_AUPLL_SDM_RESET_UMSK                             (~(((1U<<CLKRST_AUPLL_SDM_RESET_LEN)-1)<<CLKRST_AUPLL_SDM_RESET_POS))
#define CLKRST_AUPLL_SDM_FLAG                                   CLKRST_AUPLL_SDM_FLAG
#define CLKRST_AUPLL_SDM_FLAG_POS                               (20U)
#define CLKRST_AUPLL_SDM_FLAG_LEN                               (1U)
#define CLKRST_AUPLL_SDM_FLAG_MSK                               (((1U<<CLKRST_AUPLL_SDM_FLAG_LEN)-1)<<CLKRST_AUPLL_SDM_FLAG_POS)
#define CLKRST_AUPLL_SDM_FLAG_UMSK                              (~(((1U<<CLKRST_AUPLL_SDM_FLAG_LEN)-1)<<CLKRST_AUPLL_SDM_FLAG_POS))
#define CLKRST_AUPLL_SDM_BYPASS                                 CLKRST_AUPLL_SDM_BYPASS
#define CLKRST_AUPLL_SDM_BYPASS_POS                             (21U)
#define CLKRST_AUPLL_SDM_BYPASS_LEN                             (1U)
#define CLKRST_AUPLL_SDM_BYPASS_MSK                             (((1U<<CLKRST_AUPLL_SDM_BYPASS_LEN)-1)<<CLKRST_AUPLL_SDM_BYPASS_POS)
#define CLKRST_AUPLL_SDM_BYPASS_UMSK                            (~(((1U<<CLKRST_AUPLL_SDM_BYPASS_LEN)-1)<<CLKRST_AUPLL_SDM_BYPASS_POS))
#define CLKRST_AUPLL_DITHER_SEL                                 CLKRST_AUPLL_DITHER_SEL
#define CLKRST_AUPLL_DITHER_SEL_POS                             (22U)
#define CLKRST_AUPLL_DITHER_SEL_LEN                             (2U)
#define CLKRST_AUPLL_DITHER_SEL_MSK                             (((1U<<CLKRST_AUPLL_DITHER_SEL_LEN)-1)<<CLKRST_AUPLL_DITHER_SEL_POS)
#define CLKRST_AUPLL_DITHER_SEL_UMSK                            (~(((1U<<CLKRST_AUPLL_DITHER_SEL_LEN)-1)<<CLKRST_AUPLL_DITHER_SEL_POS))
#define CLKRST_DTEST_AUPLL_CLK_EN                               CLKRST_DTEST_AUPLL_CLK_EN
#define CLKRST_DTEST_AUPLL_CLK_EN_POS                           (24U)
#define CLKRST_DTEST_AUPLL_CLK_EN_LEN                           (1U)
#define CLKRST_DTEST_AUPLL_CLK_EN_MSK                           (((1U<<CLKRST_DTEST_AUPLL_CLK_EN_LEN)-1)<<CLKRST_DTEST_AUPLL_CLK_EN_POS)
#define CLKRST_DTEST_AUPLL_CLK_EN_UMSK                          (~(((1U<<CLKRST_DTEST_AUPLL_CLK_EN_LEN)-1)<<CLKRST_DTEST_AUPLL_CLK_EN_POS))

/* 0x128 : cip register */
#define CLKRST_CIP_OFFSET                                       (0x128)
#define CLKRST_PU_MBG                                           CLKRST_PU_MBG
#define CLKRST_PU_MBG_POS                                       (0U)
#define CLKRST_PU_MBG_LEN                                       (1U)
#define CLKRST_PU_MBG_MSK                                       (((1U<<CLKRST_PU_MBG_LEN)-1)<<CLKRST_PU_MBG_POS)
#define CLKRST_PU_MBG_UMSK                                      (~(((1U<<CLKRST_PU_MBG_LEN)-1)<<CLKRST_PU_MBG_POS))
#define CLKRST_PU_SFREG                                         CLKRST_PU_SFREG
#define CLKRST_PU_SFREG_POS                                     (1U)
#define CLKRST_PU_SFREG_LEN                                     (1U)
#define CLKRST_PU_SFREG_MSK                                     (((1U<<CLKRST_PU_SFREG_LEN)-1)<<CLKRST_PU_SFREG_POS)
#define CLKRST_PU_SFREG_UMSK                                    (~(((1U<<CLKRST_PU_SFREG_LEN)-1)<<CLKRST_PU_SFREG_POS))
#define CLKRST_VG11_SEL                                         CLKRST_VG11_SEL
#define CLKRST_VG11_SEL_POS                                     (4U)
#define CLKRST_VG11_SEL_LEN                                     (2U)
#define CLKRST_VG11_SEL_MSK                                     (((1U<<CLKRST_VG11_SEL_LEN)-1)<<CLKRST_VG11_SEL_POS)
#define CLKRST_VG11_SEL_UMSK                                    (~(((1U<<CLKRST_VG11_SEL_LEN)-1)<<CLKRST_VG11_SEL_POS))
#define CLKRST_VG15_SEL                                         CLKRST_VG15_SEL
#define CLKRST_VG15_SEL_POS                                     (6U)
#define CLKRST_VG15_SEL_LEN                                     (2U)
#define CLKRST_VG15_SEL_MSK                                     (((1U<<CLKRST_VG15_SEL_LEN)-1)<<CLKRST_VG15_SEL_POS)
#define CLKRST_VG15_SEL_UMSK                                    (~(((1U<<CLKRST_VG15_SEL_LEN)-1)<<CLKRST_VG15_SEL_POS))
#define CLKRST_TEN_MBG                                          CLKRST_TEN_MBG
#define CLKRST_TEN_MBG_POS                                      (8U)
#define CLKRST_TEN_MBG_LEN                                      (1U)
#define CLKRST_TEN_MBG_MSK                                      (((1U<<CLKRST_TEN_MBG_LEN)-1)<<CLKRST_TEN_MBG_POS)
#define CLKRST_TEN_MBG_UMSK                                     (~(((1U<<CLKRST_TEN_MBG_LEN)-1)<<CLKRST_TEN_MBG_POS))
#define CLKRST_TEN_SFREG                                        CLKRST_TEN_SFREG
#define CLKRST_TEN_SFREG_POS                                    (9U)
#define CLKRST_TEN_SFREG_LEN                                    (1U)
#define CLKRST_TEN_SFREG_MSK                                    (((1U<<CLKRST_TEN_SFREG_LEN)-1)<<CLKRST_TEN_SFREG_POS)
#define CLKRST_TEN_SFREG_UMSK                                   (~(((1U<<CLKRST_TEN_SFREG_LEN)-1)<<CLKRST_TEN_SFREG_POS))
#define CLKRST_TMUX                                             CLKRST_TMUX
#define CLKRST_TMUX_POS                                         (12U)
#define CLKRST_TMUX_LEN                                         (3U)
#define CLKRST_TMUX_MSK                                         (((1U<<CLKRST_TMUX_LEN)-1)<<CLKRST_TMUX_POS)
#define CLKRST_TMUX_UMSK                                        (~(((1U<<CLKRST_TMUX_LEN)-1)<<CLKRST_TMUX_POS))
#define CLKRST_DC_TP_OUT_EN                                     CLKRST_DC_TP_OUT_EN
#define CLKRST_DC_TP_OUT_EN_POS                                 (16U)
#define CLKRST_DC_TP_OUT_EN_LEN                                 (1U)
#define CLKRST_DC_TP_OUT_EN_MSK                                 (((1U<<CLKRST_DC_TP_OUT_EN_LEN)-1)<<CLKRST_DC_TP_OUT_EN_POS)
#define CLKRST_DC_TP_OUT_EN_UMSK                                (~(((1U<<CLKRST_DC_TP_OUT_EN_LEN)-1)<<CLKRST_DC_TP_OUT_EN_POS))

/* 0x12C : ldo11 register 1 */
#define CLKRST_LDO11_1_OFFSET                                   (0x12C)
#define CLKRST_LDO11_CFG0                                       CLKRST_LDO11_CFG0
#define CLKRST_LDO11_CFG0_POS                                   (0U)
#define CLKRST_LDO11_CFG0_LEN                                   (32U)
#define CLKRST_LDO11_CFG0_MSK                                   (((1U<<CLKRST_LDO11_CFG0_LEN)-1)<<CLKRST_LDO11_CFG0_POS)
#define CLKRST_LDO11_CFG0_UMSK                                  (~(((1U<<CLKRST_LDO11_CFG0_LEN)-1)<<CLKRST_LDO11_CFG0_POS))

/* 0x130 : ldo11 register 2 */
#define CLKRST_LDO11_2_OFFSET                                   (0x130)
#define CLKRST_LDO11_CFG1                                       CLKRST_LDO11_CFG1
#define CLKRST_LDO11_CFG1_POS                                   (0U)
#define CLKRST_LDO11_CFG1_LEN                                   (32U)
#define CLKRST_LDO11_CFG1_MSK                                   (((1U<<CLKRST_LDO11_CFG1_LEN)-1)<<CLKRST_LDO11_CFG1_POS)
#define CLKRST_LDO11_CFG1_UMSK                                  (~(((1U<<CLKRST_LDO11_CFG1_LEN)-1)<<CLKRST_LDO11_CFG1_POS))

/* 0x134 : rf reserved register */
#define CLKRST_RF_RESV_OFFSET                                   (0x134)
#define CLKRST_RF_RESV0                                         CLKRST_RF_RESV0
#define CLKRST_RF_RESV0_POS                                     (0U)
#define CLKRST_RF_RESV0_LEN                                     (16U)
#define CLKRST_RF_RESV0_MSK                                     (((1U<<CLKRST_RF_RESV0_LEN)-1)<<CLKRST_RF_RESV0_POS)
#define CLKRST_RF_RESV0_UMSK                                    (~(((1U<<CLKRST_RF_RESV0_LEN)-1)<<CLKRST_RF_RESV0_POS))
#define CLKRST_RF_RESV1                                         CLKRST_RF_RESV1
#define CLKRST_RF_RESV1_POS                                     (16U)
#define CLKRST_RF_RESV1_LEN                                     (16U)
#define CLKRST_RF_RESV1_MSK                                     (((1U<<CLKRST_RF_RESV1_LEN)-1)<<CLKRST_RF_RESV1_POS)
#define CLKRST_RF_RESV1_UMSK                                    (~(((1U<<CLKRST_RF_RESV1_LEN)-1)<<CLKRST_RF_RESV1_POS))

/* 0x138 : rf reserved register */
#define CLKRST_RF_OUT_RESV_OFFSET                               (0x138)
#define CLKRST_RF_OUT_RESV                                      CLKRST_RF_OUT_RESV
#define CLKRST_RF_OUT_RESV_POS                                  (0U)
#define CLKRST_RF_OUT_RESV_LEN                                  (32U)
#define CLKRST_RF_OUT_RESV_MSK                                  (((1U<<CLKRST_RF_OUT_RESV_LEN)-1)<<CLKRST_RF_OUT_RESV_POS)
#define CLKRST_RF_OUT_RESV_UMSK                                 (~(((1U<<CLKRST_RF_OUT_RESV_LEN)-1)<<CLKRST_RF_OUT_RESV_POS))


struct  clkrst_reg {
    /* 0x0 : mm_clk_ctrl_cpu */
    union {
        struct {
            uint32_t reg_pll_en                     :  1; /* [    0],        r/w,        0x1 */
            uint32_t reg_cpu_clk_en                 :  1; /* [    1],        r/w,        0x1 */
            uint32_t reg_bclk_en                    :  1; /* [    2],        r/w,        0x1 */
            uint32_t reg_a5_cpu_clk_en              :  1; /* [    3],        r/w,        0x1 */
            uint32_t reg_e74c_clk_en                :  1; /* [    4],        r/w,        0x1 */
            uint32_t hbn_uart_clk_sel               :  1; /* [    5],        r/w,        0x0 */
            uint32_t reg_e74c_clk_en_2              :  1; /* [    6],        r/w,        0x1 */
            uint32_t reserved_7                     :  1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_pll_sel                    :  2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t hbn_root_clk_sel               :  2; /* [11:10],        r/w,        0x0 */
            uint32_t reg_m4_fclk_en                 :  1; /* [   12],        r/w,        0x1 */
            uint32_t reg_m4_fclk_sel                :  1; /* [   13],        r/w,        0x1 */
            uint32_t reg_m4_hclk_en                 :  1; /* [   14],        r/w,        0x1 */
            uint32_t reg_m4_trace_en                :  1; /* [   15],        r/w,        0x1 */
            uint32_t reserved_16_23                 :  8; /* [23:16],       rsvd,        0x0 */
            uint32_t cpu_clk_sw_state               :  3; /* [26:24],          r,        0x0 */
            uint32_t reserved_27                    :  1; /* [   27],       rsvd,        0x0 */
            uint32_t m4_fclk_sw_state               :  3; /* [30:28],          r,        0x0 */
            uint32_t reserved_31                    :  1; /* [   31],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mm_clk_ctrl_cpu;

