bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/clkrst_reg.h
    /* 0x4 : mm_clk_cpu */
    union {
        struct {
            uint32_t reg_cpu_clk_div                :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_cnn_clk_div_en             :  1; /* [    8],        r/w,        0x0 */
            uint32_t reg_cnn_clk_sel                :  2; /* [10: 9],        r/w,        0x0 */
            uint32_t reserved_11_15                 :  5; /* [15:11],       rsvd,        0x0 */
            uint32_t reg_bclk_div                   :  8; /* [23:16],        r/w,        0x0 */
            uint32_t reserved_24_31                 :  8; /* [31:24],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mm_clk_cpu;

    /* 0x8 : spp_dp_clk */
    union {
        struct {
            uint32_t reg_spp_clk_div_en             :  1; /* [    0],        r/w,        0x1 */
            uint32_t reg_spp_clk_sel                :  2; /* [ 2: 1],        r/w,        0x0 */
            uint32_t reserved_3_7                   :  5; /* [ 7: 3],       rsvd,        0x0 */
            uint32_t reg_spp_clk_div                :  8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_hdmi_clk_div_en            :  1; /* [   16],        r/w,        0x1 */
            uint32_t reg_disp_clk_sel               :  1; /* [   17],        r/w,        0x0 */
            uint32_t reserved_18_19                 :  2; /* [19:18],       rsvd,        0x0 */
            uint32_t reg_disp_clk_div               :  4; /* [23:20],        r/w,        0x0 */
            uint32_t reserved_24_31                 :  8; /* [31:24],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } spp_dp_clk;

    /* 0xC : codec_clk */
    union {
        struct {
            uint32_t reserved_0_7                   :  8; /* [ 7: 0],       rsvd,        0x0 */
            uint32_t reg_h264_clk_div_en            :  1; /* [    8],        r/w,        0x1 */
            uint32_t reg_h264_clk_sel               :  2; /* [10: 9],        r/w,        0x0 */
            uint32_t reserved_11                    :  1; /* [   11],       rsvd,        0x0 */
            uint32_t reg_h264_clk_div               :  3; /* [14:12],       rsvd,        0x0 */
            uint32_t reserved_15_31                 : 17; /* [31:15],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } codec_clk;

    /* 0x10 : mm_clk_ctrl_peri */
    union {
        struct {
            uint32_t reg_i2c_clk_div                :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_i2c_clk_div_en             :  1; /* [    8],        r/w,        0x1 */
            uint32_t reg_i2cA_clk_en                :  1; /* [    9],        r/w,        0x1 */
            uint32_t reg_i2cB_clk_en                :  1; /* [   10],        r/w,        0x1 */
            uint32_t reserved_11                    :  1; /* [   11],       rsvd,        0x0 */
            uint32_t reg_sdh_clk_en                 :  1; /* [   12],        r/w,        0x1 */
            uint32_t reg_sdh_clk_sel                :  3; /* [15:13],        r/w,        0x0 */
            uint32_t reg_uart_clk_div_en            :  1; /* [   16],        r/w,        0x1 */
            uint32_t reg_uart_clk_div               :  3; /* [19:17],        r/w,        0x0 */
            uint32_t reg_eth_clk_en                 :  1; /* [   20],        r/w,        0x1 */
            uint32_t reg_eth_clk_sel                :  2; /* [22:21],        r/w,        0x0 */
            uint32_t reg_spi_clk_div_en             :  1; /* [   23],        r/w,        0x1 */
            uint32_t reg_spi_clk_div                :  8; /* [31:24],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } mm_clk_ctrl_peri;

    /* 0x14 : mm_clk_ctrl_peri2 */
    union {
        struct {
            uint32_t reg_i2s0_clk_div               :  6; /* [ 5: 0],        r/w,        0x0 */
            uint32_t reg_i2s0_ref_clk_oe            :  1; /* [    6],        r/w,        0x1 */
            uint32_t reg_i2s0_clk_en                :  1; /* [    7],        r/w,        0x0 */
            uint32_t reg_i2s1_clk_div               :  6; /* [13: 8],        r/w,        0x0 */
            uint32_t reg_i2s1_ref_clk_oe            :  1; /* [   14],        r/w,        0x1 */
            uint32_t reg_i2s1_clk_en                :  1; /* [   15],        r/w,        0x0 */
            uint32_t reg_pdm0_clk_div               :  6; /* [21:16],        r/w,        0x1 */
            uint32_t reg_pdm0_clk_en                :  1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23                    :  1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_pdm1_clk_div               :  6; /* [29:24],        r/w,        0x1 */
            uint32_t reg_pdm1_clk_en                :  1; /* [   30],        r/w,        0x1 */
            uint32_t reserved_31                    :  1; /* [   31],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mm_clk_ctrl_peri2;

    /* 0x18  reserved */
    uint8_t RESERVED0x18[8];

    /* 0x20 : mm_clk_32k */
    union {
        struct {
            uint32_t reg_en_dig_32k_gen             :  1; /* [    0],        r/w,        0x0 */
            uint32_t reg_en_comp_sat                :  1; /* [    1],        r/w,        0x0 */
            uint32_t reg_512k_sel                   :  2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_dig_32k_cnt                : 11; /* [14: 4],        r/w,      0x4b0 */
            uint32_t reserved_15_31                 : 17; /* [31:15],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mm_clk_32k;

    /* 0x24  reserved */
    uint8_t RESERVED0x24[28];

    /* 0x40 : mm_sw_sys_reset */
    union {
        struct {
            uint32_t reg_ctrl_sys_reset             :  1; /* [    0],        r/w,        0x0 */
            uint32_t reg_ctrl_cpu_reset             :  1; /* [    1],        r/w,        0x0 */
            uint32_t reg_ctrl_pwron_rst             :  1; /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_7                   :  5; /* [ 7: 3],       rsvd,        0x0 */
            uint32_t reg_ctrl_a5_cpu_reset          :  1; /* [    8],        r/w,        0x0 */
            uint32_t reg_ctrl_a5_dbg_reset          :  1; /* [    9],        r/w,        0x0 */
            uint32_t reg_ctrl_a5_peri_reset         :  1; /* [   10],        r/w,        0x0 */
            uint32_t reg_ctrl_a5_scu_reset          :  1; /* [   11],        r/w,        0x0 */
            uint32_t reg_ctrl_a5_wdt_reset          :  1; /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15                 :  3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_ctrl_e74_reset             :  1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31                 : 15; /* [31:17],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } mm_sw_sys_reset;

