bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/clkrst_reg.h
    /* 0x44 : sw_reset_mm_peri */
    union {
        struct {
            uint32_t swrst_mm_misc                  :  1; /* [    0],        r/w,        0x0 */
            uint32_t swrst_dma                      :  1; /* [    1],        r/w,        0x0 */
            uint32_t swrst_uart                     :  1; /* [    2],        r/w,        0x0 */
            uint32_t swrst_i2cA                     :  1; /* [    3],        r/w,        0x0 */
            uint32_t swrst_i2cB                     :  1; /* [    4],        r/w,        0x0 */
            uint32_t swrst_psramA                   :  1; /* [    5],        r/w,        0x0 */
            uint32_t swrst_psramB                   :  1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7                     :  1; /* [    7],       rsvd,        0x0 */
            uint32_t swrst_spi                      :  1; /* [    8],        r/w,        0x0 */
            uint32_t swrst_cci                      :  1; /* [    9],        r/w,        0x0 */
            uint32_t swrst_i2s0                     :  1; /* [   10],        r/w,        0x0 */
            uint32_t swrst_i2s1                     :  1; /* [   11],        r/w,        0x0 */
            uint32_t swrst_pdm0                     :  1; /* [   12],        r/w,        0x0 */
            uint32_t swrst_pdm1                     :  1; /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_15                 :  2; /* [15:14],       rsvd,        0x0 */
            uint32_t swrst_sdh                      :  1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_23                 :  7; /* [23:17],       rsvd,        0x0 */
            uint32_t swrst_eth                      :  1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_31                 :  7; /* [31:25],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } sw_reset_mm_peri;

    /* 0x48 : sw_reset_spp_sub */
    union {
        struct {
            uint32_t swrst_spp_misc                 :  1; /* [    0],        r/w,        0x0 */
            uint32_t swrst_spp_main                 :  1; /* [    1],        r/w,        0x0 */
            uint32_t swrst_spp_tsrc                 :  1; /* [    2],        r/w,        0x0 */
            uint32_t swrst_hdmi_tsrc                :  1; /* [    3],        r/w,        0x0 */
            uint32_t swrst_nr3d_ctrl                :  1; /* [    4],        r/w,        0x0 */
            uint32_t swrst_dvp2busA                 :  1; /* [    5],        r/w,        0x0 */
            uint32_t swrst_dvp2busB                 :  1; /* [    6],        r/w,        0x0 */
            uint32_t swrst_dvp2busC                 :  1; /* [    7],        r/w,        0x0 */
            uint32_t swrst_dvp2busD                 :  1; /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_15                  :  7; /* [15: 9],       rsvd,        0x0 */
            uint32_t swrst_spp_reg                  :  1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31                 : 15; /* [31:17],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } sw_reset_spp_sub;

    /* 0x4C : sw_reset_codec_sub */
    union {
        struct {
            uint32_t swrst_codec_misc               :  1; /* [    0],        r/w,        0x0 */
            uint32_t swrst_mjpeg                    :  1; /* [    1],        r/w,        0x0 */
            uint32_t swrst_h264                     :  1; /* [    2],        r/w,        0x0 */
            uint32_t swrst_mjpegdec                 :  1; /* [    3],        r/w,        0x0 */
            uint32_t swrst_npu                      :  1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_15                  : 11; /* [15: 5],       rsvd,        0x0 */
            uint32_t swrst_vram                     :  1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31                 : 15; /* [31:17],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } sw_reset_codec_sub;

    /* 0x50 : image_sensor_ctrl */
    union {
        struct {
            uint32_t rg_is_rst_n                    :  1; /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_31                  : 31; /* [31: 1],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } image_sensor_ctrl;

    /* 0x54  reserved */
    uint8_t RESERVED0x54[12];

    /* 0x60 : sw_reset_mask */
    union {
        struct {
            uint32_t reg_rst_mask_a5sys_to_sys      :  1; /* [    0],        r/w,        0x0 */
            uint32_t reg_rst_mask_a5wdt_to_sys      :  1; /* [    1],        r/w,        0x0 */
            uint32_t reg_rst_mask_a5sys_to_a5cpu    :  1; /* [    2],        r/w,        0x0 */
            uint32_t reg_rst_mask_a5wdt_to_a5cpu    :  1; /* [    3],        r/w,        0x0 */
            uint32_t reg_rst_mask_a5sys_to_a5dbg    :  1; /* [    4],        r/w,        0x0 */
            uint32_t reg_rst_mask_a5wdt_to_a5dbg    :  1; /* [    5],        r/w,        0x0 */
            uint32_t reg_rst_mask_a5sys_to_a5peri   :  1; /* [    6],        r/w,        0x0 */
            uint32_t reg_rst_mask_a5wdt_to_a5peri   :  1; /* [    7],        r/w,        0x0 */
            uint32_t reg_rst_mask_a5sys_to_a5scu    :  1; /* [    8],        r/w,        0x0 */
            uint32_t reg_rst_mask_a5wdt_to_a5scu    :  1; /* [    9],        r/w,        0x0 */
            uint32_t reg_rst_mask_a5sys_to_a5wdt    :  1; /* [   10],        r/w,        0x0 */
            uint32_t reg_rst_mask_a5wdt_to_a5wdt    :  1; /* [   11],        r/w,        0x0 */
            uint32_t reg_rst_mask_e74_to_sys        :  1; /* [   12],        r/w,        0x0 */
            uint32_t reg_rst_mask_e74_to_e74        :  1; /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_31                 : 18; /* [31:14],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } sw_reset_mask;

