bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/clkrst_reg.h
    /* 0x64  reserved */
    uint8_t RESERVED0x64[28];

    /* 0x80 : SYS_TICK_CFG */
    union {
        struct {
            uint32_t STCALIB                        : 26; /* [25: 0],        r/w,     0x270f */
            uint32_t reserved_26_31                 :  6; /* [31:26],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } SYS_TICK_CFG;

    /* 0x84  reserved */
    uint8_t RESERVED0x84[124];

    /* 0x100 : clkpll register 1 */
    union {
        struct {
            uint32_t clkpll_ppu                     :  1; /* [    0],        r/w,        0x0 */
            uint32_t clkpll_pu                      :  1; /* [    1],        r/w,        0x0 */
            uint32_t clkpll2_ppu                    :  1; /* [    2],        r/w,        0x0 */
            uint32_t clkpll2_pu                     :  1; /* [    3],        r/w,        0x0 */
            uint32_t ten_clkpll                     :  3; /* [ 6: 4],        r/w,        0x0 */
            uint32_t reserved_7                     :  1; /* [    7],       rsvd,        0x0 */
            uint32_t ten_clkpll2                    :  3; /* [10: 8],        r/w,        0x0 */
            uint32_t reserved_11                    :  1; /* [   11],       rsvd,        0x0 */
            uint32_t dtest_clkip_en                 :  2; /* [13:12],        r/w,        0x0 */
            uint32_t dtest_clk25M_en                :  1; /* [   14],        r/w,        0x0 */
            uint32_t dtest_pulldown                 :  1; /* [   15],        r/w,        0x1 */
            uint32_t reserved_16_31                 : 16; /* [31:16],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } clkip1;

    /* 0x104 : clkpll register 2 */
    union {
        struct {
            uint32_t clkpll_pu_vcon_cmp             :  1; /* [    0],        r/w,        0x1 */
            uint32_t clkpll_pu_pfd                  :  1; /* [    1],        r/w,        0x1 */
            uint32_t clkpll_pu_cp                   :  1; /* [    2],        r/w,        0x1 */
            uint32_t clkpll_vcon_force_en           :  1; /* [    3],        r/w,        0x1 */
            uint32_t clkpll_cp3_scale               :  2; /* [ 5: 4],        r/w,        0x3 */
            uint32_t clkpll_res_scale               :  3; /* [ 8: 6],        r/w,        0x4 */
            uint32_t clkpll_refdiv_ratio            :  4; /* [12: 9],        r/w,        0x1 */
            uint32_t clkpll_fbdiv_ratio             : 10; /* [22:13],        r/w,       0x19 */
            uint32_t clkpll_icp                     :  3; /* [25:23],        r/w,        0x3 */
            uint32_t clkpll_shrtr                   :  1; /* [   26],        r/w,        0x0 */
            uint32_t clkpll_ringcap_en              :  1; /* [   27],        r/w,        0x1 */
            uint32_t clkpll_reset                   :  1; /* [   28],        r/w,        0x0 */
            uint32_t reserved_29_31                 :  3; /* [31:29],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } clkip2;

    /* 0x108 : clkpll register 3 */
    union {
        struct {
            uint32_t clkpll_vctrl_cmp               :  2; /* [ 1: 0],          r,        0x0 */
            uint32_t clkpll_vctrl_range             :  2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t clkpll_v2i_r_cal               :  4; /* [ 7: 4],        r/w,        0x7 */
            uint32_t clkpll_v2i_idac                :  4; /* [11: 8],        r/w,        0x6 */
            uint32_t clkpll_cp_opamp_en             :  1; /* [   12],        r/w,        0x1 */
            uint32_t reserved_13_31                 : 19; /* [31:13],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } clkip3;

    /* 0x10C : clkpll register 4 */
    union {
        struct {
            uint32_t clkpll2_pu_vcon_cmp            :  1; /* [    0],        r/w,        0x1 */
            uint32_t clkpll2_pu_pfd                 :  1; /* [    1],        r/w,        0x1 */
            uint32_t clkpll2_pu_cp                  :  1; /* [    2],        r/w,        0x1 */
            uint32_t clkpll2_vcon_force_en          :  1; /* [    3],        r/w,        0x1 */
            uint32_t clkpll2_cp3_scale              :  2; /* [ 5: 4],        r/w,        0x3 */
            uint32_t clkpll2_res_scale              :  3; /* [ 8: 6],        r/w,        0x4 */
            uint32_t clkpll2_refdiv_ratio           :  4; /* [12: 9],        r/w,        0x2 */
            uint32_t clkpll2_fbdiv_ratio            : 10; /* [22:13],        r/w,       0x14 */
            uint32_t clkpll2_icp                    :  3; /* [25:23],        r/w,        0x3 */
            uint32_t clkpll2_shrtr                  :  1; /* [   26],        r/w,        0x0 */
            uint32_t clkpll2_ringcap_en             :  1; /* [   27],        r/w,        0x0 */
            uint32_t clkpll2_reset                  :  1; /* [   28],        r/w,        0x0 */
            uint32_t reserved_29_31                 :  3; /* [31:29],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } clkip4;

    /* 0x110 : clkpll register 5 */
    union {
        struct {
            uint32_t clkpll2_vctrl_cmp              :  2; /* [ 1: 0],          r,        0x0 */
            uint32_t reserved_2_3                   :  2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t clkpll2_vctrl_range            :  2; /* [ 5: 4],        r/w,        0x0 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t clkpll2_v2i_r_cal              :  4; /* [11: 8],        r/w,        0x7 */
            uint32_t clkpll2_v2i_idac               :  4; /* [15:12],        r/w,        0x6 */
            uint32_t clkpll2_cp_opamp_en            :  1; /* [   16],        r/w,        0x1 */
            uint32_t reserved_17_31                 : 15; /* [31:17],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } clkip5;

    /* 0x114 : clkip prediv */
    union {
        struct {
            uint32_t prediv_ref_sel                 :  3; /* [ 2: 0],        r/w,        0x7 */
            uint32_t pu_prediv                      :  1; /* [    3],        r/w,        0x1 */
            uint32_t prediv                         :  7; /* [10: 4],        r/w,        0xc */
            uint32_t reset_prediv                   :  1; /* [   11],        r/w,        0x0 */
            uint32_t reserved_12_31                 : 20; /* [31:12],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } clkip_prediv;

    /* 0x118 : clkip postdiv */
    union {
        struct {
            uint32_t reserved_0                     :  1; /* [    0],       rsvd,        0x0 */
            uint32_t clkpll_en_400M_clk             :  1; /* [    1],        r/w,        0x0 */
            uint32_t clkpll_en_320M_clk             :  1; /* [    2],        r/w,        0x0 */
            uint32_t clkpll_en_267M_clk             :  1; /* [    3],        r/w,        0x0 */
            uint32_t clkpll_en_240M_clk             :  1; /* [    4],        r/w,        0x0 */
            uint32_t clkpll_en_192M_clk             :  1; /* [    5],        r/w,        0x0 */
            uint32_t clkpll_en_160M_clk             :  1; /* [    6],        r/w,        0x1 */
            uint32_t clkpll_en_120M_clk             :  1; /* [    7],        r/w,        0x0 */
            uint32_t clkpll_en_100M_clk             :  1; /* [    8],        r/w,        0x0 */
            uint32_t clkpll_en_50M_clk              :  1; /* [    9],        r/w,        0x0 */
            uint32_t clkpll_en_25M_clk              :  1; /* [   10],        r/w,        0x0 */
            uint32_t reserved_11                    :  1; /* [   11],       rsvd,        0x0 */
            uint32_t pll_clk_sel                    :  2; /* [13:12],        r/w,        0x0 */
            uint32_t pu_postdiv                     :  1; /* [   14],        r/w,        0x1 */
            uint32_t reserved_15_31                 : 17; /* [31:15],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } clkip_postdiv;

