bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/Peripherals/clkrst_reg.h
    /* 0x11C : clkip aupll register 1 */
    union {
        struct {
            uint32_t aupll_vco_speed                :  3; /* [ 2: 0],        r/w,        0x4 */
            uint32_t aupll_icp                      :  3; /* [ 5: 3],        r/w,        0x3 */
            uint32_t aupll_r4_short                 :  1; /* [    6],        r/w,        0x0 */
            uint32_t aupll_r4                       :  2; /* [ 8: 7],        r/w,        0x2 */
            uint32_t aupll_c3                       :  2; /* [10: 9],        r/w,        0x3 */
            uint32_t aupll_cz                       :  2; /* [12:11],        r/w,        0x2 */
            uint32_t aupll_rz                       :  2; /* [14:13],        r/w,        0x2 */
            uint32_t reserved_15_20                 :  6; /* [20:15],       rsvd,        0x0 */
            uint32_t aupll_refdiv_ratio             :  4; /* [24:21],        r/w,        0x3 */
            uint32_t aupll_reset_refdiv             :  1; /* [   25],        r/w,        0x0 */
            uint32_t aupll_shrtr                    :  1; /* [   26],        r/w,        0x0 */
            uint32_t aupll_pu_pfd                   :  1; /* [   27],        r/w,        0x1 */
            uint32_t aupll_reset_fbdv               :  1; /* [   28],        r/w,        0x0 */
            uint32_t aupll_pu_fbdv                  :  1; /* [   29],        r/w,        0x1 */
            uint32_t aupll_cp_opamp_en              :  1; /* [   30],        r/w,        0x1 */
            uint32_t aupll_pu_cp                    :  1; /* [   31],        r/w,        0x1 */
        }BF;
        uint32_t WORD;
    } clkip_aupll1;

    /* 0x120 : clkip aupll register 2 */
    union {
        struct {
            uint32_t aupll_sdmin                    : 24; /* [23: 0],        r/w,   0x4ccccd */
            uint32_t reserved_24_31                 :  8; /* [31:24],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } clkip_aupll2;

    /* 0x124 : clkip aupll register 3 */
    union {
        struct {
            uint32_t aupll_pu                       :  1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1                     :  1; /* [    1],       rsvd,        0x0 */
            uint32_t ten_aupll                      :  2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t dtest_aupll_fsdm_en            :  1; /* [    4],        r/w,        0x0 */
            uint32_t dtest_aupll_fref_en            :  1; /* [    5],        r/w,        0x0 */
            uint32_t dtest_aupll_fin_en             :  1; /* [    6],        r/w,        0x0 */
            uint32_t aupll_postdiv                  :  7; /* [13: 7],        r/w,       0x14 */
            uint32_t aupll_sel_sample_clk           :  2; /* [15:14],        r/w,        0x1 */
            uint32_t aupll_reset_postdiv            :  1; /* [   16],        r/w,        0x0 */
            uint32_t aupll_sel_fb_clk               :  2; /* [18:17],        r/w,        0x0 */
            uint32_t aupll_sdm_reset                :  1; /* [   19],        r/w,        0x0 */
            uint32_t aupll_sdm_flag                 :  1; /* [   20],        r/w,        0x1 */
            uint32_t aupll_sdm_bypass               :  1; /* [   21],        r/w,        0x0 */
            uint32_t aupll_dither_sel               :  2; /* [23:22],        r/w,        0x0 */
            uint32_t dtest_aupll_clk_en             :  1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_31                 :  7; /* [31:25],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } clkip_aupll3;

    /* 0x128 : cip register */
    union {
        struct {
            uint32_t pu_mbg                         :  1; /* [    0],        r/w,        0x0 */
            uint32_t pu_sfreg                       :  1; /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_3                   :  2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t vg11_sel                       :  2; /* [ 5: 4],        r/w,        0x2 */
            uint32_t vg15_sel                       :  2; /* [ 7: 6],        r/w,        0x2 */
            uint32_t ten_mbg                        :  1; /* [    8],        r/w,        0x0 */
            uint32_t ten_sfreg                      :  1; /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_11                 :  2; /* [11:10],       rsvd,        0x0 */
            uint32_t tmux                           :  3; /* [14:12],        r/w,        0x0 */
            uint32_t reserved_15                    :  1; /* [   15],       rsvd,        0x0 */
            uint32_t dc_tp_out_en                   :  1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31                 : 15; /* [31:17],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } cip;

    /* 0x12C : ldo11 register 1 */
    union {
        struct {
            uint32_t ldo11_cfg0                     : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ldo11_1;

    /* 0x130 : ldo11 register 2 */
    union {
        struct {
            uint32_t ldo11_cfg1                     : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } ldo11_2;

    /* 0x134 : rf reserved register */
    union {
        struct {
            uint32_t rf_resv0                       : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t rf_resv1                       : 16; /* [31:16],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } rf_resv;

    /* 0x138 : rf reserved register */
    union {
        struct {
            uint32_t rf_out_resv                    : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } rf_out_resv;

};

typedef volatile struct clkrst_reg clkrst_reg_t;


#endif  /* __CLKRST_REG_H__ */
